---------------------------------------------------------------------------------------
       log:  /afs/ir.stanford.edu/users/t/o/tomz/AER2007/table4.log
  log type:  text
 opened on:  18 Jun 2007, 22:51:00

. 
. ***********************************
. * TOMZ, GOLDSTEIN, RIVERS TABLE 4 *
. ***********************************
. 
. * no industrial
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if i
> mf1 >= 200, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  114615
                                                       F( 58,  7821) =   50.78
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.7766
                                                       Adj R-squared =  0.7765
                                                       Root MSE      =  1.5955

                                (Std. Err. adjusted for 7822 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .6633187   .0774738     8.56   0.000     .5114493    .8151881
        onep |   .3102246   .0693913     4.47   0.000     .1741991      .44625
         gsp |  -.1813282   .0983175    -1.84   0.065    -.3740569    .0114004
    regional |   .7968588   .1494705     5.33   0.000     .5038568    1.089861
    custrict |   .4339552   .1673373     2.59   0.010     .1059293    .7619811
       lrgdp |   .8243836   .0767684    10.74   0.000     .6738971    .9748701
     lrgdppc |  -.0833417   .0755499    -1.10   0.270    -.2314397    .0647563
      curcol |  (dropped)
      yrdum2 |  -.1912614     .15661    -1.22   0.222    -.4982589     .115736
      yrdum3 |  -.0803645   .5036467    -0.16   0.873    -1.067647    .9069178
      yrdum4 |   .0449535   .5003968     0.09   0.928     -.935958    1.025865
      yrdum5 |  -.2293033   .5076632    -0.45   0.652    -1.224459    .7658523
      yrdum6 |  -.3772306   .5065181    -0.74   0.456    -1.370141    .6156802
      yrdum7 |  -.4116973   .5057292    -0.81   0.416    -1.403062    .5796671
      yrdum8 |  -.4864398   .5041654    -0.96   0.335    -1.474739    .5018591
      yrdum9 |   -.554598   .5037822    -1.10   0.271    -1.542146    .4329497
     yrdum10 |  -.4592385   .5076411    -0.90   0.366    -1.454351    .5358738
     yrdum11 |  -.6743837   .5015855    -1.34   0.179    -1.657625     .308858
     yrdum12 |  -.6818708   .5052184    -1.35   0.177    -1.672234    .3084923
     yrdum13 |  -.7076891   .5015999    -1.41   0.158    -1.690959    .2755809
     yrdum14 |  -.7896101   .5032172    -1.57   0.117     -1.77605    .1968301
     yrdum15 |  -.8545509   .5022115    -1.70   0.089     -1.83902    .1299179
     yrdum16 |  -.8593381   .5026451    -1.71   0.087    -1.844657    .1259807
     yrdum17 |  -.7914617   .5053224    -1.57   0.117    -1.782029    .1991052
     yrdum18 |  -.9015404    .505854    -1.78   0.075    -1.893149    .0900687
     yrdum19 |  -.9580615   .5058025    -1.89   0.058     -1.94957    .0334467
     yrdum20 |  -1.037617   .5080078    -2.04   0.041    -2.033448   -.0417859
     yrdum21 |  -1.216445   .5084174    -2.39   0.017    -2.213079   -.2198109
     yrdum22 |  -1.668941   .5090521    -3.28   0.001    -2.666819   -.6710628
     yrdum23 |  -1.737309    .509454    -3.41   0.001    -2.735975   -.7386432
     yrdum24 |  -1.776596   .5104279    -3.48   0.001    -2.777171   -.7760204
     yrdum25 |  -1.731263   .5103607    -3.39   0.001    -2.731707     -.73082
     yrdum26 |  -1.589739   .5124661    -3.10   0.002    -2.594309   -.5851682
     yrdum27 |  -1.418382   .5129555    -2.77   0.006    -2.423912   -.4128522
     yrdum28 |  -1.488802   .5140185    -2.90   0.004    -2.496416   -.4811886
     yrdum29 |  -1.582575   .5155954    -3.07   0.002     -2.59328   -.5718707
     yrdum30 |   -1.55697   .5167905    -3.01   0.003    -2.570017   -.5439224
     yrdum31 |  -1.610163    .517875    -3.11   0.002    -2.625336   -.5949895
     yrdum32 |  -1.590546   .5189938    -3.06   0.002    -2.607913   -.5731798
     yrdum33 |  -1.620486   .5203049    -3.11   0.002    -2.640422    -.600549
     yrdum34 |  -1.735664   .5214992    -3.33   0.001    -2.757942   -.7133861
     yrdum35 |  -1.951661   .5223941    -3.74   0.000    -2.975694   -.9276293
     yrdum36 |  -2.127441   .5235976    -4.06   0.000    -3.153832   -1.101049
     yrdum37 |  -2.221979   .5246164    -4.24   0.000    -3.250368   -1.193591
     yrdum38 |  -2.314466   .5262962    -4.40   0.000    -3.346148   -1.282785
     yrdum39 |  -2.442226    .527244    -4.63   0.000    -3.475765   -1.408687
     yrdum40 |  -2.457848   .5285259    -4.65   0.000      -3.4939   -1.421796
     yrdum41 |  -2.407619   .5297431    -4.54   0.000    -3.446057   -1.369181
     yrdum42 |  -2.336291   .5307804    -4.40   0.000    -3.376763    -1.29582
     yrdum43 |  -2.342936   .5323018    -4.40   0.000     -3.38639   -1.299482
     yrdum44 |  -2.342401   .5335448    -4.39   0.000    -3.388291    -1.29651
     yrdum45 |   -2.29164   .5347865    -4.29   0.000    -3.339964   -1.243315
     yrdum46 |  -2.377094   .5356106    -4.44   0.000    -3.427034   -1.327154
     yrdum47 |   -2.30382   .5371302    -4.29   0.000    -3.356738   -1.250901
     yrdum48 |  -2.168953   .5383282    -4.03   0.000     -3.22422   -1.113686
     yrdum49 |   -2.14766   .5394802    -3.98   0.000    -3.205185   -1.090134
     yrdum50 |  -2.077109   .5402989    -3.84   0.000    -3.136239   -1.017979
     yrdum51 |  -1.466875   .5375448    -2.73   0.006    -2.520606   -.4131434
     yrdum52 |  -1.498964   .5384189    -2.78   0.005    -2.554409   -.4435193
       _cons |  -27.33194   2.441291   -11.20   0.000    -32.11752   -22.54635
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (7822 categories)

. estimates store t4r1

. fx_pct bothp onep
bothp: % increase in trade  94% with unrounded coeff,  93% with rounded coeff
onep: % increase in trade  36% with unrounded coeff,  36% with rounded coeff

. 
. * only industrial
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if i
> mf2 < 200, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =   14394
                                                       F( 58, 348)   =       .
                                                       Prob > F      =
                                                       R-squared     =  0.9605
                                                       Adj R-squared =  0.9604
                                                       Root MSE      =  .47807

                                 (Std. Err. adjusted for 349 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .3924605   .1960811     2.00   0.046     .0068074    .7781137
        onep |   .1005884   .1856374     0.54   0.588    -.2645239    .4657008
         gsp |   .0173567   .0675472     0.26   0.797    -.1154955     .150209
    regional |   .4373035   .0638159     6.85   0.000     .3117901    .5628168
    custrict |    .987157   .2573659     3.84   0.000     .4809686    1.493345
       lrgdp |   .1923113   .1726858     1.11   0.266    -.1473279    .5319505
     lrgdppc |     .67927   .1752025     3.88   0.000      .334681    1.023859
      curcol |   .0421278    .219251     0.19   0.848     -.389096    .4733517
      yrdum2 |    .063603   .1113598     0.57   0.568    -.1554198    .2826258
      yrdum3 |  -.5873566   .1339655    -4.38   0.000    -.8508406   -.3238727
      yrdum4 |  -.4080314   .1384376    -2.95   0.003    -.6803112   -.1357517
      yrdum5 |  -.4929336   .1367046    -3.61   0.000    -.7618048   -.2240623
      yrdum6 |  -.5857427   .1436317    -4.08   0.000    -.8682381   -.3032473
      yrdum7 |  -.6386218   .1485614    -4.30   0.000    -.9308129   -.3464307
      yrdum8 |  -.6336391   .1535479    -4.13   0.000    -.9356378   -.3316403
      yrdum9 |  -.6243635   .1571849    -3.97   0.000    -.9335154   -.3152116
     yrdum10 |  -.6532994   .1605991    -4.07   0.000    -.9691664   -.3374324
     yrdum11 |  -.6976852     .16494    -4.23   0.000     -1.02209   -.3732805
     yrdum12 |  -.6893846   .1695205    -4.07   0.000    -1.022798    -.355971
     yrdum13 |  -.6012635   .1770368    -3.40   0.001    -.9494603   -.2530667
     yrdum14 |  -.5991202    .182717    -3.28   0.001    -.9584887   -.2397517
     yrdum15 |  -.6088421   .1884751    -3.23   0.001    -.9795357   -.2381485
     yrdum16 |   -.623152   .1942853    -3.21   0.001    -1.005273   -.2410309
     yrdum17 |  -.6015537    .202282    -2.97   0.003    -.9994028   -.2037046
     yrdum18 |  -.6058403   .2075264    -2.92   0.004    -1.014004   -.1976766
     yrdum19 |  -.6075792   .2136107    -2.84   0.005     -1.02771   -.1874487
     yrdum20 |  -.6792693   .2184441    -3.11   0.002    -1.108906   -.2496325
     yrdum21 |  -.7510012   .2263423    -3.32   0.001    -1.196172   -.3058302
     yrdum22 |  -.7735606   .2334738    -3.31   0.001    -1.232758   -.3143634
     yrdum23 |  -.7415721   .2398591    -3.09   0.002    -1.213328   -.2698163
     yrdum24 |  -.7407661   .2439713    -3.04   0.003     -1.22061   -.2609224
     yrdum25 |  -.6572621   .2495585    -2.63   0.009    -1.148095   -.1664293
     yrdum26 |  -.4429312   .2570369    -1.72   0.086    -.9484724      .06261
     yrdum27 |  -.3156631   .2606944    -1.21   0.227    -.8283979    .1970717
     yrdum28 |  -.4316027    .263312    -1.64   0.102    -.9494858    .0862803
     yrdum29 |  -.4376974   .2670084    -1.64   0.102    -.9628506    .0874558
     yrdum30 |  -.3953871   .2718617    -1.45   0.147    -.9300858    .1393116
     yrdum31 |  -.4270839   .2753872    -1.55   0.122    -.9687165    .1145487
     yrdum32 |  -.3287228   .2819401    -1.17   0.244    -.8832438    .2257982
     yrdum33 |  -.3486451   .2828962    -1.23   0.219    -.9050466    .2077564
     yrdum34 |  -.5128478   .2840663    -1.81   0.072    -1.071551     .045855
     yrdum35 |  -.6079313   .2877327    -2.11   0.035    -1.173845   -.0420175
     yrdum36 |  -.6751826   .2893071    -2.33   0.020    -1.244193   -.1061721
     yrdum37 |  -.6859174   .2929466    -2.34   0.020    -1.262086   -.1097488
     yrdum38 |  -.6843277   .2966124    -2.31   0.022    -1.267706   -.1009492
     yrdum39 |  -.6046658   .3011046    -2.01   0.045     -1.19688    -.012452
     yrdum40 |  -.4685727   .3060646    -1.53   0.127    -1.070542    .1333965
     yrdum41 |  -.4578869   .3086263    -1.48   0.139    -1.064894    .1491205
     yrdum42 |  -.4736971   .3173058    -1.49   0.136    -1.097776    .1503814
     yrdum43 |  -.4125521   .3222748    -1.28   0.201    -1.046404    .2212994
     yrdum44 |   -.517413   .3241397    -1.60   0.111    -1.154932    .1201062
     yrdum45 |  -.4477737   .3256456    -1.38   0.170    -1.088255    .1927076
     yrdum46 |   -.573372   .3304811    -1.73   0.084    -1.223364    .0766196
     yrdum47 |  -.5159864   .3358075    -1.54   0.125    -1.176454    .1444812
     yrdum48 |  -.4415426   .3418141    -1.29   0.197    -1.113824    .2307388
     yrdum49 |  -.4776113   .3455479    -1.38   0.168    -1.157236    .2020137
     yrdum50 |  -.4755134    .348888    -1.36   0.174    -1.161708    .2106809
     yrdum51 |  -1.404688   .4224313    -3.33   0.001    -2.235528   -.5738486
     yrdum52 |  -1.417607    .427933    -3.31   0.001    -2.259268    -.575947
       _cons |  -7.600961   5.958263    -1.28   0.203     -19.3197    4.117776
-------------+----------------------------------------------------------------
        dyad |   absorbed                                     (349 categories)

. estimates store t4r2

. fx_pct bothp onep
bothp: % increase in trade  48% with unrounded coeff,  48% with rounded coeff
onep: % increase in trade  11% with unrounded coeff,  11% with rounded coeff

. 
. * industrial with non-industrial
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if i
> mf1 < 200 & imf2 >= 200, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  105588
                                                       F( 59,  3978) =   85.18
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8761
                                                       Adj R-squared =  0.8761
                                                       Root MSE      =  1.0017

                                (Std. Err. adjusted for 3979 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |    .492435   .0986475     4.99   0.000     .2990306    .6858394
        onep |   .3191196   .0911707     3.50   0.000     .1403739    .4978654
         gsp |   .0909201   .0381892     2.38   0.017     .0160479    .1657923
    regional |   .3225804   .2014417     1.60   0.109    -.0723583    .7175191
    custrict |   .5664209   .1156258     4.90   0.000     .3397296    .7931123
       lrgdp |   .9222204   .0712436    12.94   0.000     .7825431    1.061898
     lrgdppc |  -.1279559    .071738    -1.78   0.075    -.2686025    .0126908
      curcol |   .2761096   .1651402     1.67   0.095    -.0476577    .5998769
      yrdum2 |  -.0197071   .1438217    -0.14   0.891    -.3016782     .262264
      yrdum3 |  -.4409127   .2393945    -1.84   0.066      -.91026    .0284346
      yrdum4 |  -.3462665   .2395515    -1.45   0.148    -.8159218    .1233887
      yrdum5 |  -.4578102   .2404185    -1.90   0.057    -.9291652    .0135448
      yrdum6 |  -.6036142   .2405077    -2.51   0.012    -1.075144   -.1320844
      yrdum7 |  -.5645833   .2425998    -2.33   0.020    -1.040215   -.0889517
      yrdum8 |   -.585431   .2416637    -2.42   0.015    -1.059227   -.1116346
      yrdum9 |  -.6088098   .2421898    -2.51   0.012    -1.083637   -.1339821
     yrdum10 |  -.6216382   .2427235    -2.56   0.010    -1.097512    -.145764
     yrdum11 |   -.701693   .2424234    -2.89   0.004    -1.176979   -.2264073
     yrdum12 |  -.7146106   .2432035    -2.94   0.003    -1.191426   -.2377955
     yrdum13 |  -.8783982   .2449429    -3.59   0.000    -1.358624   -.3981729
     yrdum14 |  -.9356952   .2453009    -3.81   0.000    -1.416622    -.454768
     yrdum15 |   -1.00484   .2463189    -4.08   0.000    -1.487763   -.5219172
     yrdum16 |   -1.02628   .2477226    -4.14   0.000    -1.511955   -.5406049
     yrdum17 |  -.9930021   .2493182    -3.98   0.000    -1.481806   -.5041987
     yrdum18 |  -1.019399   .2499952    -4.08   0.000     -1.50953   -.5292687
     yrdum19 |  -1.067134   .2508449    -4.25   0.000    -1.558931   -.5753379
     yrdum20 |  -1.134676   .2516037    -4.51   0.000    -1.627961   -.6413922
     yrdum21 |  -1.228115   .2526848    -4.86   0.000    -1.723519   -.7327113
     yrdum22 |   -1.42617    .253591    -5.62   0.000    -1.923351   -.9289899
     yrdum23 |  -1.434381   .2546601    -5.63   0.000    -1.933658   -.9351048
     yrdum24 |  -1.514649   .2564604    -5.91   0.000    -2.017456   -1.011843
     yrdum25 |  -1.455576   .2574563    -5.65   0.000    -1.960335   -.9508173
     yrdum26 |  -1.326366   .2586737    -5.13   0.000    -1.833512   -.8192205
     yrdum27 |  -1.116601   .2599316    -4.30   0.000    -1.626212    -.606989
     yrdum28 |   -1.19627   .2602475    -4.60   0.000    -1.706501   -.6860392
     yrdum29 |  -1.229292   .2615489    -4.70   0.000    -1.742074   -.7165092
     yrdum30 |  -1.169495   .2631489    -4.44   0.000    -1.685415   -.6535757
     yrdum31 |  -1.222221   .2638276    -4.63   0.000    -1.739471   -.7049713
     yrdum32 |  -1.232654   .2647476    -4.66   0.000    -1.751708   -.7136007
     yrdum33 |  -1.218997   .2657713    -4.59   0.000    -1.740057    -.697936
     yrdum34 |  -1.378587   .2659631    -5.18   0.000    -1.900024   -.8571503
     yrdum35 |  -1.532478   .2668642    -5.74   0.000    -2.055682   -1.009275
     yrdum36 |  -1.668424   .2679997    -6.23   0.000    -2.193853   -1.142994
     yrdum37 |  -1.709377   .2688362    -6.36   0.000    -2.236446   -1.182307
     yrdum38 |  -1.764724   .2697793    -6.54   0.000    -2.293643   -1.235805
     yrdum39 |  -1.766774   .2710999    -6.52   0.000    -2.298281   -1.235266
     yrdum40 |  -1.759052   .2713493    -6.48   0.000    -2.291048   -1.227055
     yrdum41 |  -1.749749   .2723753    -6.42   0.000    -2.283757    -1.21574
     yrdum42 |  -1.867889   .2740101    -6.82   0.000    -2.405103   -1.330676
     yrdum43 |  -1.832576   .2747017    -6.67   0.000    -2.371145   -1.294007
     yrdum44 |  -1.897893   .2759372    -6.88   0.000    -2.438885   -1.356902
     yrdum45 |  -1.904124   .2770681    -6.87   0.000    -2.447333   -1.360915
     yrdum46 |  -1.997546    .277601    -7.20   0.000    -2.541799   -1.453292
     yrdum47 |  -1.947253   .2787981    -6.98   0.000    -2.493853   -1.400652
     yrdum48 |  -1.865996   .2804025    -6.65   0.000    -2.415742    -1.31625
     yrdum49 |  -1.870857   .2813645    -6.65   0.000    -2.422489   -1.319225
     yrdum50 |  -1.877819   .2823367    -6.65   0.000    -2.431357   -1.324281
     yrdum51 |  -1.917678   .2839386    -6.75   0.000    -2.474356   -1.360999
     yrdum52 |  -2.030722   .2846828    -7.13   0.000     -2.58886   -1.472585
       _cons |  -30.72949   2.314749   -13.28   0.000    -35.26769   -26.19128
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (3979 categories)

. estimates store t4r3

. fx_pct bothp onep
bothp: % increase in trade  64% with unrounded coeff,  63% with rounded coeff
onep: % increase in trade  38% with unrounded coeff,  38% with rounded coeff

. 
. * high income
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if h
> ighi1==1 | highi2==1, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  132559
                                                       F( 59,  5129) =  122.54
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8986
                                                       Adj R-squared =  0.8986
                                                       Root MSE      =  .97963

                                (Std. Err. adjusted for 5130 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .4637096   .0887804     5.22   0.000     .2896621    .6377571
        onep |   .2443347   .0833152     2.93   0.003     .0810014    .4076681
         gsp |    .049493   .0306481     1.61   0.106    -.0105903    .1095763
    regional |   .6210336    .076869     8.08   0.000     .4703375    .7717297
    custrict |    .587307   .1045239     5.62   0.000     .3823956    .7922184
       lrgdp |   .5444897   .0531797    10.24   0.000     .4402347    .6487446
     lrgdppc |   .2597585   .0534405     4.86   0.000     .1549923    .3645247
      curcol |   .3432525    .162766     2.11   0.035     .0241616    .6623434
      yrdum2 |  -.0002413   .0956668    -0.00   0.998    -.1877891    .1873064
      yrdum3 |  -.4205173   .1335417    -3.15   0.002     -.682316   -.1587187
      yrdum4 |  -.2898879   .1340002    -2.16   0.031    -.5525855   -.0271903
      yrdum5 |  -.3934852   .1340917    -2.93   0.003    -.6563622   -.1306082
      yrdum6 |  -.4729031   .1353093    -3.49   0.000     -.738167   -.2076391
      yrdum7 |  -.4516423   .1360079    -3.32   0.001    -.7182759   -.1850088
      yrdum8 |  -.4441767   .1355373    -3.28   0.001    -.7098876   -.1784659
      yrdum9 |  -.4487119   .1363835    -3.29   0.001    -.7160818    -.181342
     yrdum10 |  -.4562156   .1371394    -3.33   0.001    -.7250674   -.1873638
     yrdum11 |  -.5358446   .1369585    -3.91   0.000    -.8043417   -.2673475
     yrdum12 |   -.537586   .1376575    -3.91   0.000    -.8074534   -.2677186
     yrdum13 |  -.5813854   .1389518    -4.18   0.000    -.8537903   -.3089805
     yrdum14 |  -.5927632   .1396671    -4.24   0.000    -.8665704   -.3189561
     yrdum15 |  -.6586418   .1407615    -4.68   0.000    -.9345945   -.3826891
     yrdum16 |  -.6693328   .1416483    -4.73   0.000    -.9470239   -.3916418
     yrdum17 |  -.6109092   .1432459    -4.26   0.000    -.8917323    -.330086
     yrdum18 |  -.6399837   .1439867    -4.44   0.000    -.9222591   -.3577083
     yrdum19 |  -.6630451   .1446442    -4.58   0.000    -.9466093   -.3794808
     yrdum20 |  -.7444744   .1454333    -5.12   0.000    -1.029586   -.4593631
     yrdum21 |  -.8032312    .146535    -5.48   0.000    -1.090502   -.5159601
     yrdum22 |  -.9710123   .1477204    -6.57   0.000    -1.260607   -.6814174
     yrdum23 |  -.9723777   .1487592    -6.54   0.000    -1.264009   -.6807461
     yrdum24 |  -1.005662   .1503252    -6.69   0.000    -1.300364   -.7109609
     yrdum25 |  -.9417983   .1513083    -6.22   0.000    -1.238427   -.6451695
     yrdum26 |  -.8113173   .1527439    -5.31   0.000    -1.110761   -.5118742
     yrdum27 |  -.6195592   .1540405    -4.02   0.000    -.9215443   -.3175741
     yrdum28 |   -.673371    .154507    -4.36   0.000    -.9762705   -.3704715
     yrdum29 |  -.6815589   .1554697    -4.38   0.000    -.9863457    -.376772
     yrdum30 |  -.6431773   .1572268    -4.09   0.000    -.9514089   -.3349457
     yrdum31 |   -.660494   .1581209    -4.18   0.000    -.9704784   -.3505095
     yrdum32 |  -.6316214   .1590183    -3.97   0.000    -.9433651   -.3198777
     yrdum33 |  -.6150483   .1599735    -3.84   0.000    -.9286647   -.3014319
     yrdum34 |  -.7591191   .1604814    -4.73   0.000    -1.073731   -.4445071
     yrdum35 |  -.9174347    .161171    -5.69   0.000    -1.233399   -.6014708
     yrdum36 |  -1.040791   .1619965    -6.42   0.000    -1.358374   -.7232088
     yrdum37 |  -1.063013    .162851    -6.53   0.000    -1.382271   -.7437561
     yrdum38 |  -1.114129   .1639294    -6.80   0.000      -1.4355   -.7927572
     yrdum39 |  -1.146093   .1651312    -6.94   0.000    -1.469821   -.8223653
     yrdum40 |  -1.091553   .1657367    -6.59   0.000    -1.416468   -.7666383
     yrdum41 |  -1.072293   .1667129    -6.43   0.000    -1.399121   -.7454645
     yrdum42 |  -1.156563   .1681096    -6.88   0.000     -1.48613   -.8269968
     yrdum43 |  -1.100382   .1692025    -6.50   0.000    -1.432092   -.7686734
     yrdum44 |  -1.164645   .1701006    -6.85   0.000    -1.498114   -.8311749
     yrdum45 |  -1.156164   .1712802    -6.75   0.000    -1.491946   -.8203817
     yrdum46 |  -1.260865   .1717613    -7.34   0.000    -1.597591   -.9241397
     yrdum47 |  -1.219392   .1730087    -7.05   0.000    -1.558563   -.8802211
     yrdum48 |  -1.128884   .1746225    -6.46   0.000    -1.471219   -.7865498
     yrdum49 |   -1.12182   .1754451    -6.39   0.000    -1.465768   -.7778732
     yrdum50 |  -1.127204   .1759676    -6.41   0.000    -1.472176   -.7822326
     yrdum51 |  -1.282756   .1785461    -7.18   0.000    -1.632782    -.932729
     yrdum52 |  -1.396135   .1795815    -7.77   0.000    -1.748191   -1.044079
       _cons |  -19.16646   1.737309   -11.03   0.000    -22.57233    -15.7606
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (5130 categories)

. estimates store t4r4

. fx_pct bothp onep
bothp: % increase in trade  59% with unrounded coeff,  58% with rounded coeff
onep: % increase in trade  28% with unrounded coeff,  27% with rounded coeff

. 
. * middle income
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if m
> idin1==1 | midin2==1, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  151972
                                                       F( 59,  8614) =   92.00
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8328
                                                       Adj R-squared =  0.8327
                                                       Root MSE      =  1.3801

                                (Std. Err. adjusted for 8615 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |    .499295   .0639547     7.81   0.000     .3739284    .6246615
        onep |   .2441154   .0581177     4.20   0.000     .1301907    .3580401
         gsp |   .2936363   .0374439     7.84   0.000     .2202373    .3670353
    regional |    .585615   .1292819     4.53   0.000     .3321915    .8390384
    custrict |   .3346615   .1728494     1.94   0.053    -.0041647    .6734877
       lrgdp |     .82844   .0604967    13.69   0.000     .7098521    .9470279
     lrgdppc |  -.0825819   .0598139    -1.38   0.167    -.1998314    .0346676
      curcol |   .4631401   .1312426     3.53   0.000     .2058732    .7204069
      yrdum2 |  -.0700765   .1032098    -0.68   0.497    -.2723924    .1322394
      yrdum3 |  -.2386661   .1866646    -1.28   0.201    -.6045735    .1272412
      yrdum4 |  -.1605167   .1866624    -0.86   0.390    -.5264197    .2053863
      yrdum5 |  -.3156244   .1878565    -1.68   0.093    -.6838681    .0526193
      yrdum6 |  -.4542884   .1884475    -2.41   0.016    -.8236906   -.0848862
      yrdum7 |  -.4802278   .1899394    -2.53   0.011    -.8525545   -.1079012
      yrdum8 |  -.5155805   .1891631    -2.73   0.006    -.8863854   -.1447756
      yrdum9 |  -.5611587   .1894128    -2.96   0.003    -.9324531   -.1898642
     yrdum10 |  -.5796883   .1904261    -3.04   0.002    -.9529691   -.2064076
     yrdum11 |  -.6707035   .1899006    -3.53   0.000    -1.042954    -.298453
     yrdum12 |   -.664777   .1909094    -3.48   0.000    -1.039005   -.2905488
     yrdum13 |  -.6979919   .1915039    -3.64   0.000    -1.073385   -.3225985
     yrdum14 |  -.7809909   .1919823    -4.07   0.000    -1.157322   -.4046596
     yrdum15 |  -.8138846    .192772    -4.22   0.000    -1.191764   -.4360054
     yrdum16 |  -.8178305   .1939405    -4.22   0.000       -1.198   -.4376606
     yrdum17 |  -.8072437   .1959289    -4.12   0.000    -1.191311   -.4231761
     yrdum18 |  -.8366435   .1967662    -4.25   0.000    -1.222352   -.4509347
     yrdum19 |  -.8896006   .1975274    -4.50   0.000    -1.276802   -.5023995
     yrdum20 |  -.9512111   .1987906    -4.78   0.000    -1.340888   -.5615339
     yrdum21 |  -1.098025   .1997471    -5.50   0.000    -1.489577   -.7064728
     yrdum22 |  -1.421437   .2009737    -7.07   0.000    -1.815394    -1.02748
     yrdum23 |  -1.458964   .2020419    -7.22   0.000    -1.855014   -1.062913
     yrdum24 |  -1.547455   .2041235    -7.58   0.000    -1.947586   -1.147324
     yrdum25 |  -1.509128    .205168    -7.36   0.000    -1.911306    -1.10695
     yrdum26 |  -1.364088   .2068784    -6.59   0.000     -1.76962   -.9585571
     yrdum27 |  -1.135445   .2084842    -5.45   0.000    -1.544124   -.7267658
     yrdum28 |  -1.224972   .2092094    -5.86   0.000    -1.635073   -.8148718
     yrdum29 |  -1.277671   .2107649    -6.06   0.000     -1.69082    -.864521
     yrdum30 |  -1.271316   .2124602    -5.98   0.000    -1.687789   -.8548435
     yrdum31 |  -1.337086   .2136205    -6.26   0.000    -1.755833   -.9183387
     yrdum32 |  -1.303754    .214802    -6.07   0.000    -1.724818    -.882691
     yrdum33 |  -1.313126    .216127    -6.08   0.000    -1.736786   -.8894649
     yrdum34 |  -1.438166   .2168398    -6.63   0.000    -1.863224   -1.013108
     yrdum35 |  -1.640855   .2178864    -7.53   0.000    -2.067964   -1.213745
     yrdum36 |  -1.770616   .2193125    -8.07   0.000    -2.200521   -1.340711
     yrdum37 |  -1.856436   .2201285    -8.43   0.000    -2.287941   -1.424931
     yrdum38 |  -1.938606   .2214632    -8.75   0.000    -2.372727   -1.504486
     yrdum39 |  -2.006456   .2226173    -9.01   0.000    -2.442839   -1.570072
     yrdum40 |  -2.016734   .2236713    -9.02   0.000    -2.455183   -1.578285
     yrdum41 |  -1.963989   .2247841    -8.74   0.000     -2.40462   -1.523359
     yrdum42 |  -1.952058   .2260839    -8.63   0.000    -2.395237    -1.50888
     yrdum43 |  -1.934294   .2272651    -8.51   0.000    -2.379788     -1.4888
     yrdum44 |  -1.971368   .2290011    -8.61   0.000    -2.420265   -1.522471
     yrdum45 |   -1.95029   .2302021    -8.47   0.000    -2.401541   -1.499039
     yrdum46 |  -2.001651   .2307331    -8.68   0.000    -2.453943   -1.549359
     yrdum47 |  -1.910724   .2320524    -8.23   0.000    -2.365603   -1.455846
     yrdum48 |  -1.796066   .2336537    -7.69   0.000    -2.254083   -1.338049
     yrdum49 |  -1.784559   .2345193    -7.61   0.000    -2.244273   -1.324845
     yrdum50 |  -1.717293   .2352985    -7.30   0.000    -2.178535   -1.256052
     yrdum51 |  -1.433744   .2333951    -6.14   0.000    -1.891254   -.9762334
     yrdum52 |   -1.48923   .2342776    -6.36   0.000     -1.94847   -1.029989
       _cons |  -27.39166   1.942737   -14.10   0.000    -31.19989   -23.58343
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (8615 categories)

. estimates store t4r5

. fx_pct bothp onep
bothp: % increase in trade  65% with unrounded coeff,  65% with rounded coeff
onep: % increase in trade  28% with unrounded coeff,  27% with rounded coeff

. 
. * low income
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if l
> owin1==1 | lowin2==1, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  106599
                                                       F( 57,  6308) =   34.62
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.7979
                                                       Adj R-squared =  0.7978
                                                       Root MSE      =  1.4882

                                (Std. Err. adjusted for 6309 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .6099554   .1197842     5.09   0.000     .3751378    .8447731
        onep |   .3762983   .1102132     3.41   0.001      .160243    .5923537
         gsp |   .3694768   .0461249     8.01   0.000     .2790563    .4598974
    regional |    1.26198    .267474     4.72   0.000     .7376402     1.78632
    custrict |   .5428774   .1663661     3.26   0.001     .2167434    .8690115
       lrgdp |   .3521697   .0891916     3.95   0.000     .1773239    .5270155
     lrgdppc |   .2256859   .0884749     2.55   0.011      .052245    .3991267
      curcol |  -.0554926   .3888027    -0.14   0.887    -.8176782    .7066929
      yrdum2 |  (dropped)
      yrdum3 |   .1913853   .2027122     0.94   0.345    -.2059995    .5887702
      yrdum4 |   .4152325   .1954257     2.12   0.034     .0321315    .7983334
      yrdum5 |   .3247618   .1923792     1.69   0.091    -.0523669    .7018904
      yrdum6 |   .1869874   .1909427     0.98   0.327    -.1873253    .5613001
      yrdum7 |   .2709864   .1849844     1.46   0.143    -.0916459    .6336188
      yrdum8 |   .3165888   .1795805     1.76   0.078      -.03545    .6686277
      yrdum9 |    .265585   .1744157     1.52   0.128    -.0763292    .6074992
     yrdum10 |   .4265033   .1751439     2.44   0.015     .0831616    .7698451
     yrdum11 |   .2840094   .1676359     1.69   0.090    -.0446139    .6126327
     yrdum12 |   .3058184   .1626159     1.88   0.060    -.0129641    .6246009
     yrdum13 |   .0475519    .155061     0.31   0.759    -.2564205    .3515242
     yrdum14 |   .0119554     .15288     0.08   0.938    -.2877414    .3116522
     yrdum15 |  -.0417962   .1478293    -0.28   0.777     -.331592    .2479995
     yrdum16 |   .0038533   .1438717     0.03   0.979    -.2781841    .2858906
     yrdum17 |   .0882914   .1403741     0.63   0.529    -.1868896    .3634725
     yrdum18 |   .0490696   .1360218     0.36   0.718    -.2175794    .3157185
     yrdum19 |   .0500363   .1322652     0.38   0.705    -.2092486    .3093211
     yrdum20 |  -.0086013    .128171    -0.07   0.946      -.25986    .2426574
     yrdum21 |  -.1181748   .1248881    -0.95   0.344    -.3629979    .1266483
     yrdum22 |  -.5040586   .1210868    -4.16   0.000    -.7414299   -.2666874
     yrdum23 |  -.5108592   .1163173    -4.39   0.000    -.7388806   -.2828379
     yrdum24 |  -.5980185   .1085394    -5.51   0.000    -.8107926   -.3852444
     yrdum25 |  -.5594902   .1062501    -5.27   0.000    -.7677766   -.3512038
     yrdum26 |  -.3915062   .1023049    -3.83   0.000    -.5920586   -.1909538
     yrdum27 |  -.2256334   .0984225    -2.29   0.022     -.418575   -.0326918
     yrdum28 |  -.2767952   .0947352    -2.92   0.003    -.4625085    -.091082
     yrdum29 |  -.3476124   .0908737    -3.83   0.000    -.5257557   -.1694691
     yrdum30 |  -.2615684   .0866525    -3.02   0.003    -.4314367   -.0917001
     yrdum31 |  -.2603434   .0843151    -3.09   0.002    -.4256297   -.0950572
     yrdum32 |  -.2816126   .0804166    -3.50   0.000    -.4392566   -.1239687
     yrdum33 |  -.2584416   .0776994    -3.33   0.001    -.4107588   -.1061243
     yrdum34 |  -.3559046   .0742787    -4.79   0.000    -.5015162   -.2102931
     yrdum35 |  -.5327922   .0717006    -7.43   0.000    -.6733499   -.3922346
     yrdum36 |  -.6973203   .0692193   -10.07   0.000    -.8330136    -.561627
     yrdum37 |  -.7861882    .067742   -11.61   0.000    -.9189855   -.6533909
     yrdum38 |   -.819008    .064963   -12.61   0.000    -.9463577   -.6916584
     yrdum39 |  -.8784903   .0632652   -13.89   0.000    -1.002512   -.7544689
     yrdum40 |   -.869878   .0635487   -13.69   0.000    -.9944551    -.745301
     yrdum41 |  -.8464888   .0621525   -13.62   0.000    -.9683288   -.7246487
     yrdum42 |  -.8290426   .0561139   -14.77   0.000     -.939045   -.7190402
     yrdum43 |  -.8174697   .0544642   -15.01   0.000    -.9242381   -.7107013
     yrdum44 |    -.80682   .0523447   -15.41   0.000    -.9094335   -.7042065
     yrdum45 |  -.6809824   .0480384   -14.18   0.000    -.7751541   -.5868107
     yrdum46 |  -.8242312   .0442481   -18.63   0.000    -.9109725   -.7374899
     yrdum47 |  -.7531089   .0417417   -18.04   0.000    -.8349367    -.671281
     yrdum48 |   -.602047   .0408641   -14.73   0.000    -.6821547   -.5219394
     yrdum49 |  -.5837748   .0401216   -14.55   0.000    -.6624268   -.5051227
     yrdum50 |  -.5118856   .0374814   -13.66   0.000    -.5853618   -.4384093
     yrdum51 |   .0296854   .0196541     1.51   0.131    -.0088433     .068214
     yrdum52 |  (dropped)
       _cons |  -11.14719   3.056047    -3.65   0.000    -17.13808   -5.156299
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (6309 categories)

. estimates store t4r6

. fx_pct bothp onep
bothp: % increase in trade  84% with unrounded coeff,  84% with rounded coeff
onep: % increase in trade  46% with unrounded coeff,  46% with rounded coeff

. 
. * least developed
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if l
> east1==1 | least2==1, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =   69085
                                                       F( 57,  4545) =   15.85
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.7755
                                                       Adj R-squared =  0.7753
                                                       Root MSE      =  1.5641

                                (Std. Err. adjusted for 4546 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .4909321   .1499729     3.27   0.001     .1969124    .7849518
        onep |   .2752992   .1362833     2.02   0.043     .0081177    .5424807
         gsp |   .3618486   .0542413     6.67   0.000     .2555092     .468188
    regional |   .1877933   .3250335     0.58   0.563    -.4494305     .825017
    custrict |   .5501234   .1576215     3.49   0.000     .2411085    .8591382
       lrgdp |   .4660414   .1176592     3.96   0.000     .2353723    .6967105
     lrgdppc |  -.0262467   .1153867    -0.23   0.820    -.2524607    .1999673
      curcol |   .0593336   .2912714     0.20   0.839    -.5116998    .6303671
      yrdum2 |  (dropped)
      yrdum3 |  (dropped)
      yrdum4 |    .250429   .1027199     2.44   0.015      .049048      .45181
      yrdum5 |    .262797    .121867     2.16   0.031     .0238784    .5017156
      yrdum6 |   .2769755   .1253433     2.21   0.027     .0312417    .5227092
      yrdum7 |   .2959333   .1377825     2.15   0.032     .0258126    .5660539
      yrdum8 |   .3330406   .1366502     2.44   0.015     .0651398    .6009413
      yrdum9 |    .182785   .1336807     1.37   0.172    -.0792942    .4448642
     yrdum10 |   .4970301   .1589245     3.13   0.002     .1854608    .8085995
     yrdum11 |    .138579   .1382086     1.00   0.316     -.132377    .4095351
     yrdum12 |   .1615994   .1360758     1.19   0.235    -.1051752    .4283741
     yrdum13 |  -.2337169   .1436916    -1.63   0.104    -.5154223    .0479884
     yrdum14 |  -.3213313   .1468583    -2.19   0.029     -.609245   -.0334175
     yrdum15 |  -.3704072   .1484016    -2.50   0.013    -.6613464    -.079468
     yrdum16 |  -.2964289   .1536031    -1.93   0.054    -.5975656    .0047078
     yrdum17 |  -.2276935    .156353    -1.46   0.145    -.5342214    .0788344
     yrdum18 |  -.3218804   .1580994    -2.04   0.042     -.631832   -.0119287
     yrdum19 |  -.2778292   .1614765    -1.72   0.085    -.5944017    .0387432
     yrdum20 |  -.3604349    .165798    -2.17   0.030    -.6854796   -.0353901
     yrdum21 |   -.485921   .1670726    -2.91   0.004    -.8134646   -.1583775
     yrdum22 |  -.8675937   .1729741    -5.02   0.000    -1.206707   -.5284804
     yrdum23 |  -.8578822   .1757936    -4.88   0.000    -1.202523   -.5132413
     yrdum24 |  -.9061995   .1824596    -4.97   0.000    -1.263909   -.5484901
     yrdum25 |    -.91473    .185325    -4.94   0.000    -1.278057   -.5514029
     yrdum26 |  -.7497314   .1894957    -3.96   0.000    -1.121235   -.3782277
     yrdum27 |  -.6206986   .1932185    -3.21   0.001    -.9995008   -.2418965
     yrdum28 |  -.6920655   .1957943    -3.53   0.000    -1.075918   -.3082135
     yrdum29 |  -.8043694   .1998286    -4.03   0.000     -1.19613   -.4126082
     yrdum30 |  -.7058559   .2060595    -3.43   0.001    -1.109833   -.3018791
     yrdum31 |  -.6989724   .2095145    -3.34   0.001    -1.109723   -.2882222
     yrdum32 |  -.6794856   .2140648    -3.17   0.002    -1.099157   -.2598145
     yrdum33 |  -.6830936   .2165277    -3.15   0.002    -1.107593   -.2585939
     yrdum34 |  -.8486656    .221242    -3.84   0.000    -1.282407   -.4149238
     yrdum35 |  -.9888053   .2245865    -4.40   0.000    -1.429104   -.5485066
     yrdum36 |  -1.208556   .2308398    -5.24   0.000    -1.661114   -.7559979
     yrdum37 |  -1.243328   .2337241    -5.32   0.000    -1.701541   -.7851149
     yrdum38 |  -1.323862   .2390421    -5.54   0.000    -1.792501   -.8552238
     yrdum39 |  -1.352814   .2406611    -5.62   0.000    -1.824627   -.8810011
     yrdum40 |  -1.417971   .2446611    -5.80   0.000    -1.897626   -.9383166
     yrdum41 |  -1.409182   .2484852    -5.67   0.000    -1.896334   -.9220303
     yrdum42 |  -1.383577   .2511822    -5.51   0.000    -1.876016   -.8911377
     yrdum43 |  -1.411071   .2536774    -5.56   0.000    -1.908402     -.91374
     yrdum44 |  -1.408656   .2576594    -5.47   0.000    -1.913794   -.9035182
     yrdum45 |  -1.288439   .2594475    -4.97   0.000    -1.797082   -.7797953
     yrdum46 |  -1.401872   .2633002    -5.32   0.000    -1.918068   -.8856754
     yrdum47 |  -1.390163   .2672518    -5.20   0.000    -1.914106   -.8662195
     yrdum48 |   -1.19801   .2720514    -4.40   0.000    -1.731363   -.6646566
     yrdum49 |  -1.218703   .2755486    -4.42   0.000    -1.758912   -.6784939
     yrdum50 |   -1.15984   .2793697    -4.15   0.000    -1.707541   -.6121399
     yrdum51 |  -.7242166   .2742927    -2.64   0.008    -1.261964   -.1864696
     yrdum52 |    -.75122   .2772469    -2.71   0.007    -1.294759   -.2076812
       _cons |  -12.43741   3.735465    -3.33   0.001    -19.76074   -5.114083
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (4546 categories)

. estimates store t4r7

. fx_pct bothp onep
bothp: % increase in trade  63% with unrounded coeff,  63% with rounded coeff
onep: % increase in trade  32% with unrounded coeff,  32% with rounded coeff

. 
. * Latin America or Caribbean
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if l
> atca1==1 | latca2==1, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =   78786
                                                       F( 59,  4001) =   45.78
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8188
                                                       Adj R-squared =  0.8187
                                                       Root MSE      =  1.4554

                                (Std. Err. adjusted for 4002 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .4484215   .0879327     5.10   0.000     .2760244    .6208186
        onep |   .2811609    .079564     3.53   0.000     .1251711    .4371506
         gsp |   .2153094   .0506954     4.25   0.000     .1159181    .3147007
    regional |   .7123419   .1594056     4.47   0.000     .3998182    1.024866
    custrict |   .1432145    .141202     1.01   0.311    -.1336201    .4200491
       lrgdp |   1.036864    .095648    10.84   0.000     .8493402    1.224387
     lrgdppc |  -.2929682   .0942888    -3.11   0.002    -.4778267   -.1081097
      curcol |   .2638455   .1709482     1.54   0.123    -.0713082    .5989992
      yrdum2 |  -.0751737   .1576106    -0.48   0.633    -.3841782    .2338309
      yrdum3 |  -.3527148   .2491751    -1.42   0.157    -.8412367    .1358071
      yrdum4 |  -.2740832   .2486051    -1.10   0.270    -.7614877    .2133212
      yrdum5 |   -.404808   .2513795    -1.61   0.107    -.8976518    .0880358
      yrdum6 |    -.49885   .2509627    -1.99   0.047    -.9908768   -.0068233
      yrdum7 |   -.488164   .2542119    -1.92   0.055    -.9865611     .010233
      yrdum8 |  -.4842444   .2536262    -1.91   0.056    -.9814931    .0130044
      yrdum9 |  -.5345664   .2539912    -2.10   0.035    -1.032531   -.0366021
     yrdum10 |  -.5923688   .2550414    -2.32   0.020    -1.092392   -.0923456
     yrdum11 |  -.6873283   .2537828    -2.71   0.007    -1.184884   -.1897727
     yrdum12 |  -.6644048   .2561716    -2.59   0.010    -1.166644   -.1621657
     yrdum13 |  -.7723798   .2588552    -2.98   0.003     -1.27988   -.2648794
     yrdum14 |  -.8165226      .2598    -3.14   0.002    -1.325875   -.3071699
     yrdum15 |  -.8667974   .2609874    -3.32   0.001    -1.378478   -.3551167
     yrdum16 |  -.8935427   .2624506    -3.40   0.001    -1.408092   -.3789933
     yrdum17 |  -.8653469   .2661449    -3.25   0.001    -1.387139   -.3435546
     yrdum18 |  -.9328427   .2674436    -3.49   0.000    -1.457181   -.4085042
     yrdum19 |  -1.043822   .2684631    -3.89   0.000    -1.570159   -.5174847
     yrdum20 |  -1.078192   .2715411    -3.97   0.000    -1.610564   -.5458206
     yrdum21 |  -1.268482   .2730774    -4.65   0.000    -1.803865   -.7330977
     yrdum22 |  -1.616546   .2749325    -5.88   0.000    -2.155567   -1.077525
     yrdum23 |  -1.631543   .2768736    -5.89   0.000     -2.17437   -1.088717
     yrdum24 |  -1.723576   .2802842    -6.15   0.000    -2.273089   -1.174063
     yrdum25 |  -1.679399   .2823357    -5.95   0.000    -2.232934   -1.125864
     yrdum26 |  -1.518976   .2850007    -5.33   0.000    -2.077736    -.960216
     yrdum27 |   -1.30277   .2870946    -4.54   0.000    -1.865635   -.7399043
     yrdum28 |  -1.409084   .2888128    -4.88   0.000    -1.975318   -.8428496
     yrdum29 |  -1.466492   .2911447    -5.04   0.000    -2.037297   -.8956859
     yrdum30 |  -1.440507   .2943993    -4.89   0.000    -2.017694   -.8633204
     yrdum31 |   -1.53012   .2955121    -5.18   0.000    -2.109488   -.9507514
     yrdum32 |  -1.511143   .2973008    -5.08   0.000    -2.094018   -.9282681
     yrdum33 |  -1.565194   .2997104    -5.22   0.000    -2.152793   -.9775946
     yrdum34 |  -1.704571    .301049    -5.66   0.000    -2.294795   -1.114348
     yrdum35 |  -1.938459   .3023528    -6.41   0.000    -2.531239   -1.345679
     yrdum36 |  -2.140025   .3042476    -7.03   0.000     -2.73652    -1.54353
     yrdum37 |  -2.182289   .3062036    -7.13   0.000    -2.782619    -1.58196
     yrdum38 |  -2.219743   .3083738    -7.20   0.000    -2.824328   -1.615159
     yrdum39 |  -2.332184   .3105156    -7.51   0.000    -2.940968   -1.723401
     yrdum40 |  -2.361364   .3125917    -7.55   0.000    -2.974218    -1.74851
     yrdum41 |  -2.259835   .3140513    -7.20   0.000    -2.875551    -1.64412
     yrdum42 |  -2.214806   .3155637    -7.02   0.000    -2.833486   -1.596125
     yrdum43 |  -2.199579   .3163995    -6.95   0.000    -2.819899    -1.57926
     yrdum44 |  -2.292593   .3193214    -7.18   0.000    -2.918641   -1.666546
     yrdum45 |   -2.27129   .3211214    -7.07   0.000    -2.900867   -1.641713
     yrdum46 |  -2.285698   .3219856    -7.10   0.000    -2.916969   -1.654427
     yrdum47 |  -2.258946   .3241869    -6.97   0.000    -2.894533   -1.623359
     yrdum48 |   -2.12331   .3265367    -6.50   0.000    -2.763504   -1.483116
     yrdum49 |  -2.101322   .3274635    -6.42   0.000    -2.743333   -1.459311
     yrdum50 |  -2.021107   .3283236    -6.16   0.000    -2.664804    -1.37741
     yrdum51 |  -1.773345   .3260421    -5.44   0.000    -2.412569   -1.134121
     yrdum52 |  -1.840758   .3273657    -5.62   0.000    -2.482577   -1.198938
       _cons |  -33.94493   3.025384   -11.22   0.000    -39.87637   -28.01349
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (4002 categories)

. estimates store t4r8

. fx_pct bothp onep
bothp: % increase in trade  57% with unrounded coeff,  57% with rounded coeff
onep: % increase in trade  32% with unrounded coeff,  32% with rounded coeff

. 
. * Sub Saharan Africa
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if s
> safr1==1 | ssafr2==1, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =   88082
                                                       F( 58,  5118) =   26.43
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.7761
                                                       Adj R-squared =  0.7760
                                                       Root MSE      =  1.5438

                                (Std. Err. adjusted for 5119 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .4008422   .1529475     2.62   0.009     .1009997    .7006846
        onep |   .0923018   .1424424     0.65   0.517    -.1869463    .3715498
         gsp |   .3939567   .0499534     7.89   0.000     .2960265    .4918868
    regional |  (dropped)
    custrict |   .4583105   .1579344     2.90   0.004     .1486915    .7679295
       lrgdp |   .1633059   .1047851     1.56   0.119    -.0421177    .3687295
     lrgdppc |     .41148   .1017215     4.05   0.000     .2120623    .6108977
      curcol |  -.0082492    .320537    -0.03   0.979    -.6366388    .6201405
      yrdum2 |  -.1247522   .1623897    -0.77   0.442    -.4431054     .193601
      yrdum3 |   .0314375   .3270594     0.10   0.923    -.6097387    .6726137
      yrdum4 |   .1568464   .3281693     0.48   0.633    -.4865058    .8001986
      yrdum5 |   .0962384   .3239739     0.30   0.766    -.5388891    .7313658
      yrdum6 |   .0526317   .3254645     0.16   0.872    -.5854179    .6906814
      yrdum7 |   .1870752   .3310253     0.57   0.572    -.4618759    .8360264
      yrdum8 |   .1210157   .3324605     0.36   0.716    -.5307489    .7727804
      yrdum9 |   .1000421   .3273863     0.31   0.760     -.541775    .7418592
     yrdum10 |   .3641909   .3335388     1.09   0.275    -.2896878     1.01807
     yrdum11 |   .2054487   .3296334     0.62   0.533    -.4407737    .8516712
     yrdum12 |   .2410367     .33169     0.73   0.467    -.4092176    .8912909
     yrdum13 |   .0980575   .3320072     0.30   0.768    -.5528185    .7489335
     yrdum14 |    .071319   .3321972     0.21   0.830    -.5799296    .7225676
     yrdum15 |   .0083826   .3334736     0.03   0.980    -.6453683    .6621334
     yrdum16 |   .0526435   .3357701     0.16   0.875    -.6056096    .7108965
     yrdum17 |   .1666968   .3374455     0.49   0.621    -.4948407    .8282343
     yrdum18 |   .1662305   .3386247     0.49   0.624    -.4976187    .8300798
     yrdum19 |   .1724339   .3403532     0.51   0.612    -.4948038    .8396716
     yrdum20 |   .1351006   .3422115     0.39   0.693    -.5357802    .8059815
     yrdum21 |   .0337133   .3432769     0.10   0.922    -.6392562    .7066828
     yrdum22 |  -.3499823   .3452403    -1.01   0.311    -1.026801    .3268364
     yrdum23 |  -.3741585   .3472287    -1.08   0.281    -1.054875    .3065583
     yrdum24 |  -.4503424   .3500797    -1.29   0.198    -1.136648    .2359634
     yrdum25 |  -.4011457   .3516385    -1.14   0.254    -1.090508    .2882162
     yrdum26 |  -.2214414    .353776    -0.63   0.531    -.9149938    .4721109
     yrdum27 |  -.0852595   .3560285    -0.24   0.811    -.7832275    .6127085
     yrdum28 |  -.1286652   .3573179    -0.36   0.719    -.8291611    .5718307
     yrdum29 |  -.2156663   .3599094    -0.60   0.549    -.9212425      .48991
     yrdum30 |  -.1240807    .362706    -0.34   0.732    -.8351396    .5869782
     yrdum31 |  -.1287809   .3650058    -0.35   0.724    -.8443484    .5867867
     yrdum32 |  -.1197825    .367603    -0.33   0.745    -.8404415    .6008766
     yrdum33 |  -.1066637   .3693224    -0.29   0.773    -.8306935    .6173662
     yrdum34 |  -.2237559    .371221    -0.60   0.547    -.9515078    .5039961
     yrdum35 |  -.3555676   .3727689    -0.95   0.340    -1.086354    .3752188
     yrdum36 |  -.5221199   .3756282    -1.39   0.165    -1.258512     .214272
     yrdum37 |  -.5922962   .3775179    -1.57   0.117    -1.332393    .1478003
     yrdum38 |  -.6461436   .3805629    -1.70   0.090     -1.39221    .0999223
     yrdum39 |  -.6620572   .3821125    -1.73   0.083    -1.411161    .0870468
     yrdum40 |  -.6613992      .3839    -1.72   0.085    -1.414007    .0912089
     yrdum41 |  -.6505722   .3858599    -1.69   0.092    -1.407023    .1058781
     yrdum42 |  -.6273202   .3877936    -1.62   0.106    -1.387562    .1329212
     yrdum43 |  -.5959547   .3904318    -1.53   0.127    -1.361368    .1694585
     yrdum44 |  -.6040697   .3931719    -1.54   0.125    -1.374855    .1667152
     yrdum45 |   -.445534   .3947764    -1.13   0.259    -1.219464    .3283965
     yrdum46 |   -.588261   .3965816    -1.48   0.138    -1.365731    .1892085
     yrdum47 |  -.5408495   .3991796    -1.35   0.176    -1.323412    .2417132
     yrdum48 |  -.3592012   .4022976    -0.89   0.372    -1.147876    .4294742
     yrdum49 |  -.3725815   .4045393    -0.92   0.357    -1.165652    .4204886
     yrdum50 |  -.3085818     .40671    -0.76   0.448    -1.105907    .4887436
     yrdum51 |   .1764881   .4027023     0.44   0.661    -.6129806    .9659568
     yrdum52 |   .1191728   .4047547     0.29   0.768    -.6743195     .912665
       _cons |  -5.145981   3.338737    -1.54   0.123    -11.69133    1.399372
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (5119 categories)

. estimates store t4r9

. fx_pct bothp onep
bothp: % increase in trade  49% with unrounded coeff,  49% with rounded coeff
onep: % increase in trade  10% with unrounded coeff,   9% with rounded coeff

. 
. * Middle East or North Africa
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if m
> enaf1==1 | menaf2==1, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =   53728
                                                       F( 56, 2853)  =       .
                                                       Prob > F      =
                                                       R-squared     =  0.8155
                                                       Adj R-squared =  0.8153
                                                       Root MSE      =   1.398

                                (Std. Err. adjusted for 2854 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .1343924   .1036926     1.30   0.195    -.0689277    .3377125
        onep |  -.0006642   .0900107    -0.01   0.994    -.1771568    .1758284
         gsp |   .6674053   .0650036    10.27   0.000     .5399465    .7948642
    regional |   .3464363   .0401732     8.62   0.000     .2676648    .4252077
    custrict |   .4716351   .2058272     2.29   0.022     .0680499    .8752203
       lrgdp |   .6959567   .0829876     8.39   0.000     .5332349    .8586784
     lrgdppc |   .0478527   .0791811     0.60   0.546    -.1074052    .2031106
      curcol |   .6153488   .2774887     2.22   0.027     .0712501    1.159448
      yrdum2 |  (dropped)
      yrdum3 |    .004127   .0859826     0.05   0.962    -.1644673    .1727213
      yrdum4 |    .078557   .0773258     1.02   0.310    -.0730632    .2301771
      yrdum5 |  (dropped)
      yrdum6 |   -.271464   .0804887    -3.37   0.001    -.4292858   -.1136422
      yrdum7 |  -.3493293    .073137    -4.78   0.000    -.4927359   -.2059226
      yrdum8 |  -.4674012   .0816214    -5.73   0.000    -.6274441   -.3073584
      yrdum9 |  -.5500076   .0876541    -6.27   0.000    -.7218794   -.3781357
     yrdum10 |  -.5096317   .0939041    -5.43   0.000    -.6937585   -.3255049
     yrdum11 |   -.641533   .0942811    -6.80   0.000    -.8263989    -.456667
     yrdum12 |  -.6463688   .0929625    -6.95   0.000    -.8286494   -.4640883
     yrdum13 |  -.5266353   .0957226    -5.50   0.000    -.7143277   -.3389429
     yrdum14 |  -.6462541   .0963483    -6.71   0.000    -.8351734   -.4573348
     yrdum15 |  -.6771057   .1014238    -6.68   0.000     -.875977   -.4782343
     yrdum16 |  -.6714122   .1049339    -6.40   0.000    -.8771661   -.4656582
     yrdum17 |  -.6916055   .1054561    -6.56   0.000    -.8983834   -.4848276
     yrdum18 |  -.7247515   .1105491    -6.56   0.000    -.9415158   -.5079872
     yrdum19 |  -.7200867   .1131862    -6.36   0.000    -.9420219   -.4981516
     yrdum20 |  -.7817075   .1175468    -6.65   0.000    -1.012193   -.5512223
     yrdum21 |  -.9279794   .1218734    -7.61   0.000    -1.166948   -.6890106
     yrdum22 |  -1.298205   .1275648   -10.18   0.000    -1.548334   -1.048077
     yrdum23 |  -1.329406   .1298001   -10.24   0.000    -1.583918   -1.074895
     yrdum24 |  -1.408669   .1385074   -10.17   0.000    -1.680254   -1.137085
     yrdum25 |  -1.423113    .142055   -10.02   0.000    -1.701654   -1.144572
     yrdum26 |  -1.293092   .1477462    -8.75   0.000    -1.582792   -1.003391
     yrdum27 |  -.9611598   .1544231    -6.22   0.000    -1.263952   -.6583677
     yrdum28 |  -.9838052   .1558074    -6.31   0.000    -1.289312   -.6782986
     yrdum29 |  -1.030121   .1620102    -6.36   0.000     -1.34779   -.7124525
     yrdum30 |  -1.099355   .1681359    -6.54   0.000    -1.429035   -.7696749
     yrdum31 |  -1.166929   .1713901    -6.81   0.000     -1.50299   -.8308679
     yrdum32 |  -1.136198   .1761272    -6.45   0.000    -1.481548   -.7908488
     yrdum33 |   -1.09895   .1820061    -6.04   0.000    -1.455827   -.7420729
     yrdum34 |  -1.093246   .1838902    -5.95   0.000    -1.453817   -.7326752
     yrdum35 |  -1.315806    .186886    -7.04   0.000    -1.682251   -.9493611
     yrdum36 |  -1.385055     .19161    -7.23   0.000    -1.760763   -1.009347
     yrdum37 |  -1.496115   .1942658    -7.70   0.000    -1.877031     -1.1152
     yrdum38 |  -1.670624   .1984479    -8.42   0.000     -2.05974   -1.281508
     yrdum39 |  -1.810099   .2003816    -9.03   0.000    -2.203007   -1.417192
     yrdum40 |  -1.783223   .2020225    -8.83   0.000    -2.179348   -1.387098
     yrdum41 |   -1.74764   .2031868    -8.60   0.000    -2.146048   -1.349232
     yrdum42 |  -1.740799   .2078221    -8.38   0.000    -2.148295   -1.333302
     yrdum43 |  -1.658156   .2119976    -7.82   0.000     -2.07384   -1.242472
     yrdum44 |   -1.68893   .2122195    -7.96   0.000    -2.105049   -1.272811
     yrdum45 |  -1.681785   .2181953    -7.71   0.000    -2.109622   -1.253949
     yrdum46 |  -1.859713   .2199647    -8.45   0.000    -2.291019   -1.428407
     yrdum47 |  -1.793051   .2225685    -8.06   0.000    -2.229462   -1.356639
     yrdum48 |  -1.701113    .226878    -7.50   0.000    -2.145974   -1.256251
     yrdum49 |  -1.610297   .2287231    -7.04   0.000    -2.058776   -1.161817
     yrdum50 |  -1.563615   .2304126    -6.79   0.000    -2.015407   -1.111823
     yrdum51 |  -1.312456   .2239668    -5.86   0.000    -1.751609   -.8733029
     yrdum52 |  -1.320553   .2255063    -5.86   0.000    -1.762725   -.8783809
       _cons |  -22.85819   2.772744    -8.24   0.000    -28.29498   -17.42141
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (2854 categories)

. estimates store t4r10

. fx_pct bothp onep
bothp: % increase in trade  14% with unrounded coeff,  14% with rounded coeff
onep: % increase in trade  -0% with unrounded coeff,   0% with rounded coeff

. 
. * South Asia
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if s
> asia1==1 | sasia2==1, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =   19874
                                                       F( 55,   927) =   11.48
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8403
                                                       Adj R-squared =  0.8398
                                                       Root MSE      =  1.2146

                                 (Std. Err. adjusted for 928 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .4138395   1.134802     0.36   0.715    -1.813239    2.640918
        onep |   .1131808   1.129976     0.10   0.920    -2.104427    2.330789
         gsp |   .4833373   .1108707     4.36   0.000     .2657506    .7009241
    regional |  (dropped)
    custrict |   .2648741   .4677567     0.57   0.571    -.6531107    1.182859
       lrgdp |   .6290971   .1589274     3.96   0.000     .3171978    .9409964
     lrgdppc |   .0459121   .1536484     0.30   0.765     -.255627    .3474512
      curcol |  (dropped)
      yrdum2 |  (dropped)
      yrdum3 |  (dropped)
      yrdum4 |   .1983807   .0773284     2.57   0.010     .0466217    .3501397
      yrdum5 |  -.0776909   .0753944    -1.03   0.303    -.2256545    .0702727
      yrdum6 |  -.3752144   .0938418    -4.00   0.000    -.5593813   -.1910474
      yrdum7 |   -.395938   .0856191    -4.62   0.000    -.5639677   -.2279083
      yrdum8 |  -.3899473   .0947354    -4.12   0.000     -.575868   -.2040266
      yrdum9 |  -.5329678   .1056359    -5.05   0.000     -.740281   -.3256546
     yrdum10 |  -.5250671   .1109074    -4.73   0.000    -.7427259   -.3074083
     yrdum11 |  -.5975053   .1173864    -5.09   0.000    -.8278792   -.3671313
     yrdum12 |  -.6648026   .1213976    -5.48   0.000    -.9030485   -.4265566
     yrdum13 |  -.7458682   .1239212    -6.02   0.000    -.9890668   -.5026696
     yrdum14 |  -.7972894   .1274674    -6.25   0.000    -1.047447   -.5471313
     yrdum15 |  -.8682042   .1373595    -6.32   0.000    -1.137776   -.5986325
     yrdum16 |  -.8948751   .1467737    -6.10   0.000    -1.182922   -.6068278
     yrdum17 |  -.9126142   .1559841    -5.85   0.000    -1.218737   -.6064913
     yrdum18 |  -1.023661   .1587017    -6.45   0.000    -1.335117   -.7122043
     yrdum19 |  -1.074623   .1664711    -6.46   0.000    -1.401327   -.7479195
     yrdum20 |  -1.155881   .1723118    -6.71   0.000    -1.494048   -.8177147
     yrdum21 |  -1.346814   .1796476    -7.50   0.000    -1.699377   -.9942505
     yrdum22 |  -1.577762   .1895806    -8.32   0.000    -1.949819   -1.205706
     yrdum23 |  -1.620291    .197338    -8.21   0.000    -2.007572    -1.23301
     yrdum24 |  -1.887581   .2083769    -9.06   0.000    -2.296526   -1.478635
     yrdum25 |  -1.676283   .1933846    -8.67   0.000    -2.055806   -1.296761
     yrdum26 |  -1.529964   .2029275    -7.54   0.000    -1.928215   -1.131714
     yrdum27 |  -1.477686   .2117307    -6.98   0.000    -1.893213   -1.062159
     yrdum28 |  -1.528152   .2184011    -7.00   0.000     -1.95677   -1.099534
     yrdum29 |  -1.609199   .2276688    -7.07   0.000    -2.056005   -1.162393
     yrdum30 |   -1.48953   .2369014    -6.29   0.000    -1.954455   -1.024605
     yrdum31 |  -1.594678   .2463289    -6.47   0.000    -2.078105   -1.111251
     yrdum32 |  -1.526505   .2559636    -5.96   0.000     -2.02884   -1.024169
     yrdum33 |  -1.506175   .2618879    -5.75   0.000    -2.020137   -.9922129
     yrdum34 |  -1.625235   .2611149    -6.22   0.000     -2.13768    -1.11279
     yrdum35 |  -1.872481   .2699206    -6.94   0.000    -2.402207   -1.342754
     yrdum36 |  -1.998407   .2815707    -7.10   0.000    -2.550996   -1.445817
     yrdum37 |  -1.978141   .2850567    -6.94   0.000    -2.537572    -1.41871
     yrdum38 |  -1.977409   .2910603    -6.79   0.000    -2.548622   -1.406195
     yrdum39 |  -2.087468   .2993909    -6.97   0.000    -2.675031   -1.499906
     yrdum40 |  -2.189506   .3067238    -7.14   0.000    -2.791459   -1.587552
     yrdum41 |   -2.19087   .3119843    -7.02   0.000    -2.803147   -1.578592
     yrdum42 |  -2.175231    .317572    -6.85   0.000    -2.798474   -1.551987
     yrdum43 |  -2.101885   .3270717    -6.43   0.000    -2.743772   -1.459998
     yrdum44 |  -2.070539   .3301361    -6.27   0.000    -2.718439   -1.422638
     yrdum45 |  -1.978869   .3390163    -5.84   0.000    -2.644197    -1.31354
     yrdum46 |  -2.066279   .3413073    -6.05   0.000    -2.736104   -1.396455
     yrdum47 |  -1.954521   .3472624    -5.63   0.000    -2.636032   -1.273009
     yrdum48 |  -1.822201   .3571882    -5.10   0.000    -2.523192    -1.12121
     yrdum49 |  -1.808391   .3590324    -5.04   0.000    -2.513001    -1.10378
     yrdum50 |  -1.793379   .3647667    -4.92   0.000    -2.509244   -1.077515
     yrdum51 |  -.8341164   .3153199    -2.65   0.008     -1.45294   -.2152929
     yrdum52 |  -.8197971   .3173512    -2.58   0.010    -1.442607   -.1969871
       _cons |  -20.39252   5.676888    -3.59   0.000    -31.53357   -9.251482
-------------+----------------------------------------------------------------
        dyad |   absorbed                                     (928 categories)

. estimates store t4r11

. fx_pct bothp onep
bothp: % increase in trade  51% with unrounded coeff,  51% with rounded coeff
onep: % increase in trade  12% with unrounded coeff,  12% with rounded coeff

. 
. * East Asia
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52 if e
> asia1==1 | easia2==1, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =   49263
                                                       F( 59,  2508) =   53.02
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8619
                                                       Adj R-squared =  0.8617
                                                       Root MSE      =  1.2991

                                (Std. Err. adjusted for 2509 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .6848558   .1383584     4.95   0.000     .4135475    .9561642
        onep |   .2509138   .1251541     2.00   0.045     .0054978    .4963299
         gsp |   .2229159   .0716629     3.11   0.002     .0823913    .3634405
    regional |   .2060631   .1748495     1.18   0.239     -.136801    .5489272
    custrict |   1.569279   .3511573     4.47   0.000     .8806911    2.257867
       lrgdp |   .2940745   .1324917     2.22   0.027     .0342701    .5538788
     lrgdppc |   .4619957   .1299247     3.56   0.000      .207225    .7167664
      curcol |   .8863231   .1963573     4.51   0.000      .501284    1.271362
      yrdum2 |   .0834634   .1590999     0.52   0.600    -.2285173     .395444
      yrdum3 |  -.5427351   .3993781    -1.36   0.174     -1.32588    .2404095
      yrdum4 |  -.0480064   .3985313    -0.12   0.904    -.8294905    .7334777
      yrdum5 |  -.1615048   .4071641    -0.40   0.692    -.9599172    .6369076
      yrdum6 |  -.4973344   .4097642    -1.21   0.225    -1.300845    .3061765
      yrdum7 |   -.502221   .4100432    -1.22   0.221    -1.306279     .301837
      yrdum8 |  -.5054369   .4043388    -1.25   0.211    -1.298309    .2874351
      yrdum9 |   -.467866   .4064682    -1.15   0.250    -1.264914    .3291816
     yrdum10 |  -.2430131   .4175785    -0.58   0.561    -1.061847    .5758208
     yrdum11 |  -.4873133    .407907    -1.19   0.232    -1.287182    .3125556
     yrdum12 |  -.5283647   .4083596    -1.29   0.196    -1.329121    .2723918
     yrdum13 |  -.5574243   .4066996    -1.37   0.171    -1.354926    .2400771
     yrdum14 |   -.661265    .409101    -1.62   0.106    -1.463475    .1409453
     yrdum15 |  -.6691587   .4094734    -1.63   0.102    -1.472099     .133782
     yrdum16 |  -.7043889   .4111458    -1.71   0.087    -1.510609    .1018312
     yrdum17 |  -.5689834    .416112    -1.37   0.172    -1.384942    .2469749
     yrdum18 |  -.5748844   .4169835    -1.38   0.168    -1.392552    .2427828
     yrdum19 |  -.6393963   .4198534    -1.52   0.128    -1.462691    .1838986
     yrdum20 |  -.7173875   .4224387    -1.70   0.090    -1.545752     .110977
     yrdum21 |  -.7927833   .4234623    -1.87   0.061    -1.623155    .0375884
     yrdum22 |  -1.069764   .4265874    -2.51   0.012    -1.906264   -.2332645
     yrdum23 |  -1.129088     .42903    -2.63   0.009    -1.970377   -.2877983
     yrdum24 |  -1.167608   .4339263    -2.69   0.007    -2.018499   -.3167175
     yrdum25 |  -1.079464   .4360848    -2.48   0.013    -1.934587   -.2243408
     yrdum26 |  -.9779866   .4404356    -2.22   0.026    -1.841641   -.1143318
     yrdum27 |  -.7051431   .4420124    -1.60   0.111     -1.57189    .1616036
     yrdum28 |  -.7655709   .4450812    -1.72   0.086    -1.638335    .1071935
     yrdum29 |  -.7477543   .4477972    -1.67   0.095    -1.625845    .1303359
     yrdum30 |  -.6549456   .4503098    -1.45   0.146    -1.537963    .2280715
     yrdum31 |  -.6858924   .4536679    -1.51   0.131    -1.575494    .2037096
     yrdum32 |  -.6174856   .4577095    -1.35   0.177    -1.515013    .2800418
     yrdum33 |  -.5920119    .459683    -1.29   0.198    -1.493409    .3093852
     yrdum34 |  -.6662524    .462381    -1.44   0.150     -1.57294    .2404353
     yrdum35 |  -.8513889   .4658147    -1.83   0.068     -1.76481     .062032
     yrdum36 |  -.9977022   .4681584    -2.13   0.033    -1.915719   -.0796857
     yrdum37 |  -1.104953   .4707673    -2.35   0.019    -2.028086   -.1818209
     yrdum38 |  -1.136154   .4739349    -2.40   0.017    -2.065497   -.2068098
     yrdum39 |   -1.16799   .4773993    -2.45   0.014    -2.104127   -.2318526
     yrdum40 |  -1.117996   .4808136    -2.33   0.020    -2.060828   -.1751633
     yrdum41 |  -.9837714   .4835315    -2.03   0.042    -1.931933   -.0356096
     yrdum42 |  -.9647339   .4870115    -1.98   0.048     -1.91972    -.009748
     yrdum43 |   -.948142   .4894102    -1.94   0.053    -1.907832    .0115475
     yrdum44 |  -.8474942   .4928902    -1.72   0.086    -1.814008    .1190192
     yrdum45 |  -.8069814   .4962954    -1.63   0.104    -1.780172    .1662093
     yrdum46 |  -.8289375   .4995988    -1.66   0.097    -1.808606    .1507308
     yrdum47 |  -.7702617   .5027517    -1.53   0.126    -1.756113    .2155893
     yrdum48 |  -.6187813   .5058267    -1.22   0.221    -1.610662    .3730996
     yrdum49 |  -.6656748   .5087356    -1.31   0.191     -1.66326      .33191
     yrdum50 |  -.5976889   .5115805    -1.17   0.243    -1.600852    .4054746
     yrdum51 |  -.2102024   .5065961    -0.41   0.678    -1.203592    .7831872
     yrdum52 |  -.2017637   .5087773    -0.40   0.692     -1.19943    .7959029
       _cons |  -10.97801   4.306065    -2.55   0.011    -19.42181   -2.534201
-------------+----------------------------------------------------------------
        dyad |   absorbed                                    (2509 categories)

. estimates store t4r12

. fx_pct bothp onep
bothp: % increase in trade  98% with unrounded coeff,  97% with rounded coeff
onep: % increase in trade  29% with unrounded coeff,  28% with rounded coeff

. 
. * Print Table 4
. estimates table t4r1 t4r2 t4r3 t4r4 t4r5 t4r6, se b(%5.2f) keep(bothp onep)

--------------------------------------------------------------------------
    Variable |  t4r1      t4r2      t4r3      t4r4      t4r5      t4r6    
-------------+------------------------------------------------------------
       bothp |    0.66      0.39      0.49      0.46      0.50      0.61  
             |    0.08      0.20      0.10      0.09      0.06      0.12  
        onep |    0.31      0.10      0.32      0.24      0.24      0.38  
             |    0.07      0.19      0.09      0.08      0.06      0.11  
--------------------------------------------------------------------------
                                                              legend: b/se

. estimates table t4r7 t4r8 t4r9 t4r10 t4r11 t4r12, se b(%5.2f) keep(bothp onep)

--------------------------------------------------------------------------
    Variable |  t4r7      t4r8      t4r9      t4r10     t4r11     t4r12   
-------------+------------------------------------------------------------
       bothp |    0.49      0.45      0.40      0.13      0.41      0.68  
             |    0.15      0.09      0.15      0.10      1.13      0.14  
        onep |    0.28      0.28      0.09     -0.00      0.11      0.25  
             |    0.14      0.08      0.14      0.09      1.13      0.13  
--------------------------------------------------------------------------
                                                              legend: b/se

. estimates stats t4r1 t4r2 t4r3 t4r4 t4r5 t4r6 t4r7 t4r8 t4r9 t4r10 t4r11 t4r12

------------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+----------------------------------------------------------------
        t4r1 |  114615  -216503.4   -212099.2     58     424314.3      424874
        t4r2 |  14394   -20648.51   -9595.123     58     19306.25    19745.57
        t4r3 |  105588  -161097.4   -147943.4     59     296004.8    296569.2
        t4r4 |  132559  -202357.8   -182718.9     59     365555.8    366133.7
        t4r5 |  151972  -270061.2   -260129.7     59     520377.3    520963.3
        t4r6 |  106599  -193067.9   -190357.3     57     380828.7    381374.6
        t4r7 |  69085   -127493.3   -126546.4     57     253206.7    253727.9
        t4r8 |  78786   -143354.4   -139272.4     59     278662.9    279210.1
        t4r9 |  88082   -162282.8   -160562.7     58     321241.4    321785.7
       t4r10 |  53728   -96685.37   -92743.93     56     185599.9    186097.8
       t4r11 |  19874   -32613.78    -31560.4     55     63230.81    63665.15
       t4r12 |  49263   -88294.86   -81472.67     59     163063.3    163582.8
------------------------------------------------------------------------------

. 
. log close
       log:  /afs/ir.stanford.edu/users/t/o/tomz/AER2007/table4.log
  log type:  text
 closed on:  18 Jun 2007, 23:16:18
---------------------------------------------------------------------------------------
