-------------------------------------------------------------------------------
       log:  C:\My Documents\ps299\paper4\log\checks.log
  log type:  text
 opened on:  24 Feb 2002, 04:52:54

. * specification checks;
. * table 5;
. #delimit ;
delimiter now ;
. * kosimo data excluding latent crises;
. relogit crisis intcivdy postcold diffbloc border mindem mod postciv blocciv
>         bordeciv demciv modciv crisisyrs crisisyrs1 crisisyrs2 crisisyrs3 dym
> ilbal 
>         majpow distance, wc(.0031) cluster(dyad);
(383 missing values generated)


Corrected logit estimates                             Number of obs =    42461

------------------------------------------------------------------------------
             |               Robust
      crisis |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    intcivdy |  -1.642597   .6836992    -2.40   0.016    -2.982623   -.3025714
    postcold |   .3528444   .3564048     0.99   0.322    -.3456962    1.051385
    diffbloc |   .6946963   .4326145     1.61   0.108    -.1532125    1.542605
      border |   2.539763   .3847839     6.60   0.000       1.7856    3.293925
      mindem |  -.1226286   .0285365    -4.30   0.000    -.1785591   -.0666982
         mod |  -.2045651   1.448853    -0.14   0.888    -3.044265    2.635134
     postciv |  -.9359331   .5076245    -1.84   0.065    -1.930859    .0589927
     blocciv |   .1430104   .5168426     0.28   0.782    -.8699825    1.156003
    bordeciv |   .3390975   .5700508     0.59   0.552    -.7781816    1.456377
      demciv |   .1100047   .0388066     2.83   0.005     .0339451    .1860643
      modciv |   2.624487   1.905385     1.38   0.168    -1.109998    6.358973
   crisisyrs |  -1.454381   .0878794   -16.55   0.000    -1.626621    -1.28214
  crisisyrs1 |  -.0139756   .0010072   -13.88   0.000    -.0159497   -.0120014
  crisisyrs2 |   .0098749   .0008102    12.19   0.000      .008287    .0114628
  crisisyrs3 |  -.0030644   .0003545    -8.64   0.000    -.0037593   -.0023695
    dymilbal |  -.8104695   .6562375    -1.24   0.217    -2.096671    .4757324
      majpow |   1.844521    .301077     6.13   0.000     1.254421    2.434621
    distance |  -.3094329   .1455913    -2.13   0.034    -.5947866   -.0240793
       _cons |  -.5869428   1.148278    -0.51   0.609    -2.837526     1.66364
------------------------------------------------------------------------------

. log close;
       log:  C:\My Documents\ps299\paper4\log\checks.log
  log type:  text
 closed on:  24 Feb 2002, 04:53:15
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------
       log:  C:\My Documents\ps299\paper4\log\checks.log
  log type:  text
 opened on:  24 Feb 2002, 04:53:16

. * icb model;
. relogit icb intcivdy postcold diffbloc border mindem mod postciv blocciv
>         bordeciv demciv modciv icbyrs icbyrs1 icbyrs2 icbyrs3 dymilbal 
>         majpow distance, wc(.0013) cluster(dyad);
(202 missing values generated)


Corrected logit estimates                             Number of obs =    36364

------------------------------------------------------------------------------
             |               Robust
         icb |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    intcivdy |  -2.532546   .6800998    -3.72   0.000    -3.865517   -1.199575
    postcold |  -.2429052   .4835727    -0.50   0.615     -1.19069    .7048799
    diffbloc |   .3813922   .3468477     1.10   0.272    -.2984169    1.061201
      border |   2.440444   .3483218     7.01   0.000     1.757746    3.123142
      mindem |  -.1036151   .0294014    -3.52   0.000    -.1612409   -.0459894
         mod |  -.1237967   1.524722    -0.08   0.935    -3.112197    2.864603
     postciv |  -.6617314   .6694665    -0.99   0.323    -1.973862    .6503988
     blocciv |   .1210514   .4446145     0.27   0.785    -.7503769    .9924798
    bordeciv |   .9820996   .4502552     2.18   0.029     .0996155    1.864584
      demciv |   .0753606   .0368202     2.05   0.041     .0031944    .1475269
      modciv |    4.41452   1.991014     2.22   0.027     .5122043    8.316836
      icbyrs |  -.5516311   .0533053   -10.35   0.000    -.6561075   -.4471546
     icbyrs1 |  -.0048655   .0007321    -6.65   0.000    -.0063004   -.0034307
     icbyrs2 |   .0035713   .0006968     5.13   0.000     .0022056     .004937
     icbyrs3 |   -.001133   .0003408    -3.32   0.001    -.0018009   -.0004651
    dymilbal |  -.7184455   .8819008    -0.81   0.415    -2.446939    1.010048
      majpow |   2.062656   .3229953     6.39   0.000     1.429597    2.695715
    distance |  -.2464799   .1355136    -1.82   0.069    -.5120816    .0191218
       _cons |  -2.353172   1.151427    -2.04   0.041    -4.609928   -.0964163
------------------------------------------------------------------------------

. log close;
       log:  C:\My Documents\ps299\paper4\log\checks.log
  log type:  text
 closed on:  24 Feb 2002, 04:53:31
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------
       log:  C:\My Documents\ps299\paper4\log\checks.log
  log type:  text
 opened on:  24 Feb 2002, 04:53:32

. * mid model;
. relogit mid intcivdy postcold diffbloc border mindem mod postciv blocciv
>         bordeciv demciv modciv midyrs midyrs1 midyrs2 midyrs3 dymilbal 
>         majpow distance, wc(.0056) cluster(dyad);
(78 missing values generated)


Corrected logit estimates                             Number of obs =    35216

------------------------------------------------------------------------------
             |               Robust
         mid |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    intcivdy |  -1.112497   .4097699    -2.71   0.007    -1.915631   -.3093628
    postcold |   .2025164   .3348422     0.60   0.545    -.4537621     .858795
    diffbloc |   .6816574   .2128704     3.20   0.001      .264439    1.098876
      border |   1.825766   .2111593     8.65   0.000     1.411901     2.23963
      mindem |  -.1175554     .02257    -5.21   0.000    -.1617919    -.073319
         mod |   1.579735   .9146492     1.73   0.084    -.2129449    3.372414
     postciv |  -.7661494   .4722858    -1.62   0.105    -1.691813    .1595138
     blocciv |   .1258581   .3051146     0.41   0.680    -.4721555    .7238718
    bordeciv |   .2349553   .3289877     0.71   0.475    -.4098487    .8797593
      demciv |   .0644722   .0283372     2.28   0.023     .0089324     .120012
      modciv |   2.009834    1.18812     1.69   0.091    -.3188391    4.338506
      midyrs |  -.6579414   .0374225   -17.58   0.000    -.7312883   -.5845946
     midyrs1 |  -.0069296   .0005579   -12.42   0.000     -.008023   -.0058361
     midyrs2 |   .0053295    .000509    10.47   0.000     .0043318    .0063271
     midyrs3 |  -.0016375   .0002158    -7.59   0.000    -.0020605   -.0012145
    dymilbal |  -1.841649   .4581485    -4.02   0.000    -2.739603    -.943694
      majpow |   2.110193   .1668992    12.64   0.000     1.783076    2.437309
    distance |  -.5330533    .087488    -6.09   0.000    -.7045266     -.36158
       _cons |    .902525    .698955     1.29   0.197    -.4674016    2.272452
------------------------------------------------------------------------------

. log close;
       log:  C:\My Documents\ps299\paper4\log\checks.log
  log type:  text
 closed on:  24 Feb 2002, 04:53:47
-------------------------------------------------------------------------------
