-------------------------------------------------------------------------------
       log:  C:\My Documents\ps299\paper4\log\priorcorr.log
  log type:  text
 opened on:  24 Feb 2002, 16:30:18

. * table 12;
. * prior correction;
. relogit kosimo intcivdy postcold diffbloc border mindem mod peaceyrs _spline1
>  
>         _spline2 _spline3 dymilbal majpow distance, pc(.0079) cluster(dyad);
(383 missing values generated)


Corrected logit estimates                             Number of obs =    42461

------------------------------------------------------------------------------
             |               Robust
      kosimo |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    intcivdy |  -1.098247    .280849    -3.91   0.000    -1.648701   -.5477929
    postcold |  -.5101763   .2012857    -2.53   0.011     -.904689   -.1156636
    diffbloc |   .9543579   .2180234     4.38   0.000       .52704    1.381676
      border |   3.004736     .27478    10.94   0.000     2.466177    3.543295
      mindem |  -.0412331   .0131666    -3.13   0.002    -.0670391   -.0154271
         mod |   2.927628   .7933072     3.69   0.000     1.372774    4.482482
    peaceyrs |  -1.326362   .0592836   -22.37   0.000    -1.442555   -1.210168
    _spline1 |    -.01217   .0007322   -16.62   0.000    -.0136051    -.010735
    _spline2 |   .0086358   .0006534    13.22   0.000     .0073551    .0099165
    _spline3 |  -.0027339   .0003212    -8.51   0.000    -.0033634   -.0021044
    dymilbal |  -1.533814   .5790548    -2.65   0.008    -2.668741   -.3988878
      majpow |   3.004419   .2023883    14.84   0.000     2.607746    3.401093
    distance |  -.3796948   .1264871    -3.00   0.003    -.6276049   -.1317848
       _cons |  -.2255289   .9855877    -0.23   0.819    -2.157245    1.706187
------------------------------------------------------------------------------

. relogit kosimo intcivdy postcold diffbloc border mindem mod postciv blocciv
>         bordeciv demciv modciv peaceyrs _spline1 _spline2 _spline3 dymilbal 
>         majpow distance, pc(.0079) cluster(dyad);
(383 missing values generated)


Corrected logit estimates                             Number of obs =    42461

------------------------------------------------------------------------------
             |               Robust
      kosimo |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    intcivdy |   -2.31869   .5871693    -3.95   0.000     -3.46952   -1.167859
    postcold |  -.5323814   .2867005    -1.86   0.063    -1.094304    .0295412
    diffbloc |   .6314173   .4205445     1.50   0.133    -.1928348    1.455669
      border |   2.455882    .304168     8.07   0.000     1.859724    3.052041
      mindem |  -.0713558   .0193629    -3.69   0.000    -.1093063   -.0334053
         mod |   2.756542   1.385669     1.99   0.047     .0406807    5.472404
     postciv |   .0707614   .4268265     0.17   0.868    -.7658032     .907326
     blocciv |   .6426464   .4937099     1.30   0.193    -.3250072      1.6103
    bordeciv |   1.287765   .4214947     3.06   0.002     .4616503    2.113879
      demciv |   .0572149   .0254428     2.25   0.025     .0073479    .1070819
      modciv |   .9076089   1.637534     0.55   0.579    -2.301899    4.117117
    peaceyrs |  -1.315843   .0580785   -22.66   0.000    -1.429675   -1.202011
    _spline1 |  -.0120665   .0007196   -16.77   0.000    -.0134769   -.0106562
    _spline2 |   .0085808   .0006422    13.36   0.000     .0073222    .0098394
    _spline3 |  -.0027359   .0003153    -8.68   0.000    -.0033539    -.002118
    dymilbal |  -1.641823   .5677115    -2.89   0.004    -2.754517   -.5291285
      majpow |   2.986347   .2084934    14.32   0.000     2.577708    3.394987
    distance |  -.3469793   .1232507    -2.82   0.005    -.5885462   -.1054124
       _cons |   .0921986   1.032696     0.09   0.929    -1.931847    2.116245
------------------------------------------------------------------------------

. lincom postcold+postciv;

 ( 1)  postcold + postciv = 0.0

------------------------------------------------------------------------------
      kosimo |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    -.46162   .3075368    -1.50   0.133    -1.064381    .1411411
------------------------------------------------------------------------------

. lincom diffbloc+blocciv;

 ( 1)  diffbloc + blocciv = 0.0

------------------------------------------------------------------------------
      kosimo |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.274064   .2789454     4.57   0.000     .7273407    1.820787
------------------------------------------------------------------------------

. lincom border+bordeciv;

 ( 1)  border + bordeciv = 0.0

------------------------------------------------------------------------------
      kosimo |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.743647   .3762924     9.95   0.000     3.006128    4.481167
------------------------------------------------------------------------------

. lincom mindem+demciv;

 ( 1)  mindem + demciv = 0.0

------------------------------------------------------------------------------
      kosimo |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0141409   .0169157    -0.84   0.403    -.0472951    .0190134
------------------------------------------------------------------------------

. lincom mod+modciv;

 ( 1)  mod + modciv = 0.0

------------------------------------------------------------------------------
      kosimo |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.664151   .9366067     3.91   0.000     1.828436    5.499867
------------------------------------------------------------------------------

. log close;
       log:  C:\My Documents\ps299\paper4\log\priorcorr.log
  log type:  text
 closed on:  24 Feb 2002, 16:30:50
-------------------------------------------------------------------------------
