---------------------------------------------------------------------------------------
       log:  /afs/ir.stanford.edu/users/t/o/tomz/AER2007/table2.log
  log type:  text
 opened on:  18 Jun 2007, 21:45:34

. 
. ***********************************
. * TOMZ, GOLDSTEIN, RIVERS TABLE 2 *
. ***********************************
. 
. capture program drop fx_pct

. program define fx_pct
  1.    version 9.2
  2.    syntax varlist
  3.    foreach v in `varlist' {
  4.       di "`v': % increase in trade " %3.0f 100*(exp(_b[`v'])-1) "% with unrounded 
> coeff, " %3.0f 100*(exp( round(_b[`v'],.01) )-1) "% with rounded coeff"
  5.    }
  6. end

. 
. * Table 2, Column 1: ROSE'S FORMAL MEMBERS, YEAR FIXED EFFECTS (REPLICATES AER 2004 T
> able 1.1)
. areg ltrade bothin onein gsp ldist lrgdp lrgdppc regional custrict comlang border lan
> dl island lareap comcol curcol colony comctry, a(year) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  234597
                                                       F( 17, 12149) = 1932.80
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6480
                                                       Adj R-squared =  0.6479
                                                       Root MSE      =  1.9796

                               (Std. Err. adjusted for 12150 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      bothin |  -.0422915   .0527727    -0.80   0.423    -.1457344    .0611514
       onein |  -.0582516   .0485887    -1.20   0.231    -.1534932    .0369899
         gsp |   .8585277   .0318431    26.96   0.000     .7961101    .9209452
       ldist |  -1.119029   .0220728   -50.70   0.000    -1.162295   -1.075762
       lrgdp |    .915903   .0096085    95.32   0.000     .8970688    .9347373
     lrgdppc |   .3214132   .0140783    22.83   0.000     .2938174    .3490089
    regional |   1.198811   .1061947    11.29   0.000     .9906523    1.406969
    custrict |   1.118147   .1216824     9.19   0.000     .8796305    1.356664
     comlang |   .3125448   .0402862     7.76   0.000     .2335775    .3915122
      border |   .5257054   .1107067     4.75   0.000     .3087026    .7427081
       landl |  -.2705915   .0312273    -8.67   0.000     -.331802   -.2093811
      island |    .041927   .0360876     1.16   0.245    -.0288104    .1126644
      lareap |  -.0967329   .0079954   -12.10   0.000    -.1124053   -.0810606
      comcol |   .5845614   .0671543     8.70   0.000     .4529283    .7161945
      curcol |   1.075146   .2346942     4.58   0.000      .615108    1.535184
      colony |   1.163838   .1172321     9.93   0.000     .9340441    1.393631
     comctry |  -.0163045   1.080947    -0.02   0.988    -2.135133    2.102524
       _cons |  -27.77277   .3699192   -75.08   0.000    -28.49787   -27.04767
-------------+----------------------------------------------------------------
        year |   absorbed                                      (52 categories)

. estimates store t2c1  /* store table2 column 1 */

. fx_pct bothin onein   
bothin: % increase in trade  -4% with unrounded coeff,  -4% with rounded coeff
onein: % increase in trade  -6% with unrounded coeff,  -6% with rounded coeff

. 
. * Table 2, Column 2: CORRECTED FORMAL MEMBERS, YEAR FIXED EFFECTS
. areg ltrade gattff gattfo gsp ldist lrgdp lrgdppc regional custrict comlang border la
> ndl island lareap comcol curcol colony comctry, a(year) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  234597
                                                       F( 17, 12149) = 1936.86
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6487
                                                       Adj R-squared =  0.6487
                                                       Root MSE      =  1.9775

                               (Std. Err. adjusted for 12150 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gattff |  -.1679855   .0339968    -4.94   0.000    -.2346247   -.1013463
      gattfo |  -.2693027   .0372236    -7.23   0.000    -.3422668   -.1963386
         gsp |   .8602775   .0319635    26.91   0.000      .797624    .9229311
       ldist |  -1.122384   .0220674   -50.86   0.000     -1.16564   -1.079129
       lrgdp |    .923504   .0096147    96.05   0.000     .9046577    .9423503
     lrgdppc |   .3162535   .0140939    22.44   0.000     .2886271    .3438799
    regional |   1.196261   .1069848    11.18   0.000     .9865542    1.405969
    custrict |   1.146702   .1218735     9.41   0.000     .9078111    1.385594
     comlang |   .3018292   .0401636     7.51   0.000     .2231021    .3805564
      border |   .5110432   .1103343     4.63   0.000     .2947704    .7273161
       landl |  -.2677992   .0311466    -8.60   0.000    -.3288515   -.2067469
      island |   .0312208    .036047     0.87   0.386     -.039437    .1018786
      lareap |  -.0953699   .0079465   -12.00   0.000    -.1109463   -.0797936
      comcol |    .563778   .0670013     8.41   0.000     .4324447    .6951113
      curcol |   .9764794    .233124     4.19   0.000     .5195192     1.43344
      colony |   1.159574   .1160294     9.99   0.000     .9321379     1.38701
     comctry |  -.0316934   1.074544    -0.03   0.976    -2.137971    2.074584
       _cons |  -27.94432    .369163   -75.70   0.000    -28.66794   -27.22071
-------------+----------------------------------------------------------------
        year |   absorbed                                      (52 categories)

. estimates store t2c2

. fx_pct gattff gattfo 
gattff: % increase in trade -15% with unrounded coeff, -16% with rounded coeff
gattfo: % increase in trade -24% with unrounded coeff, -24% with rounded coeff

. 
. * Table 2, Column 3: PARTICIPATION x 5, YEAR FIXED EFFECTS
. areg ltrade gattff gattfn gattnn gattfo gattno gsp ldist lrgdp lrgdppc regional custr
> ict comlang border landl island lareap comcol curcol colony comctry, a(year) robust c
> luster(dyad)

Linear regression, absorbing indicators                Number of obs =  234597
                                                       F( 20, 12149) = 1688.51
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6494
                                                       Adj R-squared =  0.6494
                                                       Root MSE      =  1.9756

                               (Std. Err. adjusted for 12150 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gattff |   .1730054   .0670326     2.58   0.010     .0416108       .3044
      gattfn |   .4103101   .0706846     5.80   0.000     .2717571    .5488631
      gattnn |   .7955161   .1415658     5.62   0.000     .5180247    1.073008
      gattfo |   .0636023   .0653944     0.97   0.331    -.0645811    .1917857
      gattno |   .3266469   .0901092     3.63   0.000     .1500184    .5032753
         gsp |   .8509001   .0317762    26.78   0.000     .7886138    .9131865
       ldist |   -1.12893   .0221022   -51.08   0.000    -1.172254   -1.085607
       lrgdp |   .9256436   .0095854    96.57   0.000     .9068548    .9444325
     lrgdppc |    .312202    .014133    22.09   0.000     .2844991     .339905
    regional |   1.186577   .1097032    10.82   0.000     .9715417    1.401613
    custrict |   1.113713   .1226477     9.08   0.000     .8733044    1.354122
     comlang |    .311894     .04015     7.77   0.000     .2331937    .3905943
      border |   .5173931   .1101461     4.70   0.000     .3014891    .7332971
       landl |  -.2687854   .0311505    -8.63   0.000    -.3298454   -.2077255
      island |   .0181928   .0360691     0.50   0.614    -.0525083    .0888939
      lareap |  -.0927124   .0079166   -11.71   0.000    -.1082302   -.0771946
      comcol |      .5234    .067254     7.78   0.000     .3915715    .6552286
      curcol |   .9369614    .233699     4.01   0.000     .4788742    1.395049
      colony |   1.153412    .115437     9.99   0.000     .9271374    1.379687
     comctry |  -.0191176   1.070815    -0.02   0.986    -2.118085     2.07985
       _cons |  -28.32485   .3683937   -76.89   0.000    -29.04696   -27.60274
-------------+----------------------------------------------------------------
        year |   absorbed                                      (52 categories)

. estimates store t2c3

. fx_pct gattff gattfn gattnn gattfo gattno  
gattff: % increase in trade  19% with unrounded coeff,  19% with rounded coeff
gattfn: % increase in trade  51% with unrounded coeff,  51% with rounded coeff
gattnn: % increase in trade 122% with unrounded coeff, 123% with rounded coeff
gattfo: % increase in trade   7% with unrounded coeff,   6% with rounded coeff
gattno: % increase in trade  39% with unrounded coeff,  39% with rounded coeff

. 
. * Table 2, Column 4: PARTICIPATION x 5, YEAR AND COUNTRY FIXED EFFECTS
. areg ltrade gattff gattfn gattnn gattfo gattno gsp ldist lrgdp lrgdppc regional custr
> ict comlang border landl island lareap comcol curcol colony comctry c111-c968, a(year
> ) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  234597
                                                       F(194, 12149) =  272.63
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.7035
                                                       Adj R-squared =  0.7033
                                                       Root MSE      =  1.8173

                               (Std. Err. adjusted for 12150 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gattff |   .5405102   .0636608     8.49   0.000     .4157249    .6652954
      gattfn |   .6439992    .064265    10.02   0.000     .5180295    .7699689
      gattnn |   .8617583   .1174386     7.34   0.000     .6315601    1.091957
      gattfo |   .2364551   .0570125     4.15   0.000     .1247016    .3482087
      gattno |   .4016182   .0778735     5.16   0.000     .2489738    .5542625
         gsp |   .7049422   .0316561    22.27   0.000     .6428912    .7669932
       ldist |  -1.311532   .0228075   -57.50   0.000    -1.356238   -1.266826
       lrgdp |   .1848214    .051512     3.59   0.000     .0838497     .285793
     lrgdppc |   .5183645    .049201    10.54   0.000     .4219228    .6148063
    regional |   .9366088   .1268002     7.39   0.000     .6880602    1.185157
    custrict |   1.174172   .1221496     9.61   0.000     .9347393    1.413605
     comlang |   .2732761    .043485     6.28   0.000     .1880385    .3585136
      border |   .2813834   .1082532     2.60   0.009     .0691898     .493577
       landl |  -1.530293   .3237945    -4.73   0.000    -2.164982   -.8956045
      island |  -1.033926   .1887665    -5.48   0.000    -1.403939   -.6639138
      lareap |   .3724687   .0325347    11.45   0.000     .3086956    .4362418
      comcol |   .6047132   .0644932     9.38   0.000     .4782963    .7311301
      curcol |   .7267353   .2623116     2.77   0.006     .2125629    1.240908
      colony |   1.275849   .1142473    11.17   0.000     1.051906    1.499792
     comctry |   .3235916   .5815488     0.56   0.578    -.8163367     1.46352
        c111 |   1.343597   .2058099     6.53   0.000     .9401771    1.747017
        c112 |   1.330665   .1742495     7.64   0.000     .9891081    1.672222
        c122 |   1.360838   .3111733     4.37   0.000     .7508892    1.970788
        c124 |   1.630873   .1647704     9.90   0.000     1.307897    1.953849
        c128 |   .3403361   .1366214     2.49   0.013     .0725364    .6081359
        c132 |   .8979183   .1696735     5.29   0.000     .5653312    1.230505
        c134 |   1.643563   .1750221     9.39   0.000     1.300491    1.986634
        c136 |   1.099358   .1676569     6.56   0.000     .7707237    1.427992
        c137 |   .3549629   .3342434     1.06   0.288    -.3002075    1.010133
        c138 |   1.857397   .1525177    12.18   0.000     1.558438    2.156356
        c142 |  -.5847831   .1710989    -3.42   0.001    -.9201643    -.249402
        c144 |   .0465082   .1564765     0.30   0.766    -.2602107    .3532271
        c146 |   2.292406   .3191918     7.18   0.000     1.666739    2.918073
        c156 |  -.7221263   .2045758    -3.53   0.000    -1.123127   -.3211252
        c158 |   3.316249   .2044272    16.22   0.000     2.915539    3.716959
        c172 |  -.8032072   .1632017    -4.92   0.000    -1.123108    -.483306
        c174 |  -.6433096   .1484068    -4.33   0.000    -.9342106   -.3524085
        c176 |   -1.44289   .1927599    -7.49   0.000    -1.820731    -1.06505
        c178 |   -.411739   .1476291    -2.79   0.005    -.7011155   -.1223625
        c181 |   .5729639   .2186044     2.62   0.009     .1444645    1.001463
        c182 |   .1180538   .1480602     0.80   0.425    -.1721678    .4082755
        c184 |   .2253501   .1673295     1.35   0.178    -.1026423    .5533426
        c186 |  -1.219457   .1667584    -7.31   0.000     -1.54633   -.8925835
        c188 |  -.0803263   .1758003    -0.46   0.648    -.4249229    .2642702
        c193 |  (dropped)
        c196 |   .6072279   .1486509     4.08   0.000     .3158484    .8986074
        c199 |  -.0783134   .1858571    -0.42   0.673    -.4426229    .2859962
        c213 |  -.7765412   .1871629    -4.15   0.000     -1.14341   -.4096722
        c218 |  -1.082212   .3221853    -3.36   0.001    -1.713746   -.4506773
        c223 |  -.3334586    .206424    -1.62   0.106    -.7380824    .0711653
        c228 |  -.7713972   .1834576    -4.20   0.000    -1.131003   -.4117911
        c233 |   -1.48632   .1786591    -8.32   0.000     -1.83652    -1.13612
        c238 |  -.9028266   .1612653    -5.60   0.000    -1.218932   -.5867208
        c243 |  -1.108512   .1603181    -6.91   0.000    -1.422761   -.7942629
        c248 |    -1.0804    .168407    -6.42   0.000    -1.410504   -.7502951
        c253 |  -.8816641    .151722    -5.81   0.000    -1.179063   -.5842649
        c258 |  -.9114239   .1605518    -5.68   0.000    -1.226131   -.5967169
        c263 |  -2.286582   .1951485   -11.72   0.000    -2.669104    -1.90406
        c268 |  -1.154987   .1763382    -6.55   0.000    -1.500637   -.8093357
        c273 |  -.9580589   .1778259    -5.39   0.000    -1.306626   -.6094917
        c278 |  -1.819477   .1745644   -10.42   0.000    -2.161651   -1.477303
        c283 |  -.2731757   .1734646    -1.57   0.115    -.6131938    .0668425
        c288 |  -.3799976   .3199562    -1.19   0.235    -1.007163    .2471675
        c293 |  -1.328297   .1791509    -7.41   0.000    -1.679461   -.9771327
        c298 |  -1.119207   .1781585    -6.28   0.000    -1.468426   -.7699884
        c299 |  -.8998877   .1755092    -5.13   0.000    -1.243914   -.5558617
        c311 |  -.4016128   .2614564    -1.54   0.125     -.914109    .1108833
        c313 |  -.6809542    .222675    -3.06   0.002    -1.117433   -.2444758
        c316 |  -.0214594   .2308259    -0.09   0.926    -.4739149    .4309962
        c319 |   .1444859   .2737047     0.53   0.598    -.3920189    .6809907
        c321 |  -1.084009   .2470491    -4.39   0.000    -1.568264   -.5997535
        c328 |  -.6824105    .242626    -2.81   0.005    -1.157996   -.2068248
        c336 |  -2.601356   .2444588   -10.64   0.000    -3.080534   -2.122177
        c339 |  -3.306948   .2518494   -13.13   0.000    -3.800613   -2.813283
        c343 |   .2357003   .1881984     1.25   0.210    -.1331985    .6045991
        c361 |  -1.018652   .2783486    -3.66   0.000     -1.56426   -.4730447
        c362 |  -.5675154   .2589283    -2.19   0.028    -1.075056   -.0599747
        c364 |   -.962534   .2483811    -3.88   0.000      -1.4494   -.4756676
        c366 |  -2.303273   .2589314    -8.90   0.000     -2.81082   -1.795727
        c369 |   .4347211   .1901518     2.29   0.022     .0619932    .8074489
        c419 |   1.150712   .2483839     4.63   0.000     .6638398    1.637584
        c423 |  -.1099314   .1562246    -0.70   0.482    -.4161564    .1962937
        c429 |  -.7681214   .1981957    -3.88   0.000    -1.156617   -.3796262
        c433 |  -.9222697   .1948754    -4.73   0.000    -1.304256   -.5402829
        c436 |   .0068592   .1483057     0.05   0.963    -.2838436     .297562
        c439 |  -1.112679   .1714121    -6.49   0.000    -1.448674   -.7766837
        c443 |  -.7689862   .1856676    -4.14   0.000    -1.132924   -.4050482
        c446 |  (dropped)
        c449 |  -1.658428   .2136828    -7.76   0.000    -2.077281   -1.239576
        c453 |  -1.845232   .2318129    -7.96   0.000    -2.299622   -1.390842
        c456 |  -.6176039    .207114    -2.98   0.003     -1.02358   -.2116275
        c463 |  -1.598784   .1736301    -9.21   0.000    -1.939127   -1.258441
        c466 |  -.7301104   .1955598    -3.73   0.000    -1.113439   -.3467821
        c469 |  -1.210437   .1780468    -6.80   0.000    -1.559437   -.8614367
        c474 |  -1.371167   .2254197    -6.08   0.000    -1.813026   -.9293085
        c513 |     -.2127   .1933941    -1.10   0.271    -.5917832    .1663832
        c514 |  -2.034691   .4785542    -4.25   0.000    -2.972733   -1.096648
        c518 |  -1.911935   .2512499    -7.61   0.000    -2.404425   -1.419445
        c522 |  -1.574806   .1924452    -8.18   0.000    -1.952029   -1.197583
        c524 |   .9791512   .1820075     5.38   0.000     .6223875    1.335915
        c532 |   3.004453   .1697043    17.70   0.000     2.671805      3.3371
        c534 |  -.0359308   .2335126    -0.15   0.878    -.4936526    .4217911
        c536 |   .0134099    .202736     0.07   0.947     -.383985    .4108048
        c542 |   1.572466   .1718303     9.15   0.000     1.235651     1.90928
        c544 |  -2.585025   .4210211    -6.14   0.000    -3.410294   -1.759757
        c548 |   .4620982   .1539122     3.00   0.003     .1604059    .7637906
        c556 |  (dropped)
        c558 |  -.9632932   .3308197    -2.91   0.004    -1.611753    -.314834
        c564 |  -.4156029   .1840661    -2.26   0.024    -.7764017   -.0548041
        c566 |   .9923739   .1739996     5.70   0.000     .6513069    1.333441
        c576 |   4.289979   .2365387    18.14   0.000     3.826326    4.753633
        c578 |    .584132   .1716575     3.40   0.001     .2476559     .920608
        c582 |   1.100575   .1838121     5.99   0.000     .7402738    1.460876
        c611 |   -1.41188    .268302    -5.26   0.000    -1.937795   -.8859655
        c612 |  -1.877717   .2006039    -9.36   0.000    -2.270932   -1.484501
        c614 |  -1.621089   .2306955    -7.03   0.000    -2.073289   -1.168889
        c616 |   -1.83798   .3625557    -5.07   0.000    -2.548647   -1.127314
        c618 |  -.1831686   .3297598    -0.56   0.579    -.8295504    .4632132
        c622 |  -2.125334    .192368   -11.05   0.000    -2.502406   -1.748262
        c624 |  -.3892864   .2839535    -1.37   0.170    -.9458805    .1673077
        c626 |  -2.085694   .3314691    -6.29   0.000    -2.735426   -1.435962
        c628 |  -2.204016   .3457625    -6.37   0.000    -2.881765   -1.526266
        c632 |  -.1991925    .300862    -0.66   0.508    -.7889299    .3905449
        c634 |  -2.781741   .2205372   -12.61   0.000    -3.214029   -2.349453
        c636 |  -1.694242   .2249986    -7.53   0.000    -2.135275   -1.253209
        c638 |  -2.606408   .2025336   -12.87   0.000    -3.003406    -2.20941
        c642 |  -3.019772   .3002476   -10.06   0.000    -3.608305   -2.431239
        c644 |   .0080455    .318189     0.03   0.980    -.6156556    .6317466
        c646 |  -2.477783   .2533712    -9.78   0.000    -2.974431   -1.981136
        c648 |  -1.889378   .2346297    -8.05   0.000    -2.349289   -1.429466
        c652 |  -1.535928   .1810605    -8.48   0.000    -1.890836   -1.181021
        c654 |  -2.150588   .2676601    -8.03   0.000    -2.675245   -1.625932
        c656 |  -2.110081   .2501442    -8.44   0.000    -2.600404   -1.619759
        c662 |  -1.053487   .1779128    -5.92   0.000    -1.402225   -.7047499
        c664 |  -1.184989   .1809389    -6.55   0.000    -1.539658   -.8303204
        c666 |  -1.291006    .365402    -3.53   0.000    -2.007252   -.5747603
        c668 |  -.8997454   .2218457    -4.06   0.000    -1.334598   -.4648925
        c672 |  -1.940249   .2548089    -7.61   0.000    -2.439715   -1.440783
        c674 |  -1.285067   .1479868    -8.68   0.000    -1.575145   -.9949891
        c676 |    .267934   .3393381     0.79   0.430    -.3972227    .9330908
        c678 |  -1.697466   .3297548    -5.15   0.000    -2.343838   -1.051094
        c682 |  -2.897789   .2780961   -10.42   0.000    -3.442901   -2.352676
        c684 |   .4687226   .2139367     2.19   0.028     .0493726    .8880726
        c686 |  -.7892924   .1604831    -4.92   0.000    -1.103865   -.4747199
        c688 |  -1.986957   .2083355    -9.54   0.000    -2.395328   -1.578587
        c692 |  -1.959975   .3232051    -6.06   0.000    -2.593508   -1.326441
        c694 |  -1.219645   .2186206    -5.58   0.000    -1.648176   -.7911138
        c696 |   .8307889   .2393156     3.47   0.001     .3616923    1.299886
        c698 |  -.0181232   .3152735    -0.06   0.954    -.6361096    .5998631
        c714 |   -.557547   .3244181    -1.72   0.086    -1.193458     .078364
        c716 |  -.5434035   .4074054    -1.33   0.182    -1.341983    .2551761
        c718 |  -.2306932   .2740085    -0.84   0.400    -.7677935    .3064071
        c722 |  -1.720213     .18197    -9.45   0.000    -2.076903   -1.363523
        c724 |  -2.373945   .1937867   -12.25   0.000    -2.753798   -1.994093
        c726 |  -2.401744   .2092435   -11.48   0.000    -2.811894   -1.991593
        c728 |  -3.331007   .3470092    -9.60   0.000      -4.0112   -2.650814
        c732 |   -2.16745   .2217102    -9.78   0.000    -2.602037   -1.732862
        c734 |  -.2946159   .3250241    -0.91   0.365    -.9317149    .3424831
        c738 |  -1.586965   .1954793    -8.12   0.000    -1.970136   -1.203795
        c742 |  -1.296166   .1805106    -7.18   0.000    -1.649995   -.9423362
        c744 |  -1.324441   .1551819    -8.53   0.000    -1.628622    -1.02026
        c746 |  -.4341879   .3130793    -1.39   0.166    -1.047873    .1794973
        c748 |  -1.458415   .3200604    -4.56   0.000    -2.085784   -.8310454
        c754 |  -.5829657   .3274941    -1.78   0.075    -1.224906     .058975
        c813 |  -1.229888   .2906474    -4.23   0.000    -1.799603   -.6601724
        c819 |  -.7318867   .1984811    -3.69   0.000    -1.120941   -.3428322
        c826 |  -.0395067   .3571029    -0.11   0.912    -.7394853    .6604719
        c846 |  -1.272972   .3627497    -3.51   0.000    -1.984019   -.5619244
        c853 |   -2.16644   .2188849    -9.90   0.000    -2.595489   -1.737391
        c862 |  -1.016869    .377546    -2.69   0.007    -1.756919   -.2768187
        c866 |  -1.156739   .3011216    -3.84   0.000    -1.746986   -.5664931
        c911 |  -.2559878   .3410849    -0.75   0.453    -.9245685    .4125929
        c912 |   .3867117   .3438263     1.12   0.261    -.2872426    1.060666
        c913 |   .4885854   .3246578     1.50   0.132    -.1477956    1.124966
        c914 |  -2.580024   .2144318   -12.03   0.000    -3.000344   -2.159703
        c915 |  -2.109137    .236613    -8.91   0.000    -2.572936   -1.645338
        c916 |   .3277938   .3389058     0.97   0.333    -.3365156    .9921032
        c917 |  -.4449334   .3832351    -1.16   0.246    -1.196135    .3062685
        c918 |  -1.075488   .1597156    -6.73   0.000    -1.388556   -.7624201
        c921 |   .4069319   .3293587     1.24   0.217    -.2386637    1.052527
        c922 |   .5514974   .2386601     2.31   0.021     .0836855    1.019309
        c923 |  (dropped)
        c924 |    1.14257    .247214     4.62   0.000     .6579914    1.627149
        c925 |  -.6378032   .3757742    -1.70   0.090     -1.37438     .098774
        c926 |   .3055613    .220341     1.39   0.166    -.1263421    .7374648
        c927 |   .5387141    .353614     1.52   0.128    -.1544255    1.231854
        c935 |   1.652071   .3099756     5.33   0.000     1.044469    2.259672
        c936 |   .5133079   .3112043     1.65   0.099    -.0967021    1.123318
        c939 |  -1.168713    .193523    -6.04   0.000    -1.548049   -.7893769
        c941 |  -1.417494    .183238    -7.74   0.000    -1.776669   -1.058318
        c944 |   .9333736   .3122638     2.99   0.003     .3212869     1.54546
        c946 |  -1.156376   .2052763    -5.63   0.000     -1.55875   -.7540016
        c948 |  -2.150956   .3829342    -5.62   0.000    -2.901568   -1.400344
        c960 |  -1.221783   .1865701    -6.55   0.000     -1.58749   -.8560763
        c961 |  -.2473471    .145142    -1.70   0.088    -.5318485    .0371543
        c962 |   .3093271   .3306597     0.94   0.350    -.3388186    .9574728
        c964 |   -.475882   .1591458    -2.99   0.003    -.7878332   -.1639308
        c968 |   .1093977   .1696978     0.64   0.519     -.223237    .4420325
       _cons |   -4.76231   1.310015    -3.64   0.000    -7.330148   -2.194472
-------------+----------------------------------------------------------------
        year |   absorbed                                      (52 categories)

. estimates store t2c4

. fx_pct gattff gattfn gattnn gattfo gattno 
gattff: % increase in trade  72% with unrounded coeff,  72% with rounded coeff
gattfn: % increase in trade  90% with unrounded coeff,  90% with rounded coeff
gattnn: % increase in trade 137% with unrounded coeff, 136% with rounded coeff
gattfo: % increase in trade  27% with unrounded coeff,  27% with rounded coeff
gattno: % increase in trade  49% with unrounded coeff,  49% with rounded coeff

. 
. * Table 2, Column 5: PARTICIPATION x 5, YEAR AND DYADIC FIXED EFFECTS
. areg ltrade gattff gattfn gattnn gattfo gattno gsp regional custrict lrgdp lrgdppc cu
> rcol yrdum2-yrdum52, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  234597
                                                       F( 62, 12149) =  136.56
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8532
                                                       Adj R-squared =  0.8531
                                                       Root MSE      =  1.3129

                               (Std. Err. adjusted for 12150 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gattff |   .4763512   .0599721     7.94   0.000     .3587963    .5939061
      gattfn |   .5645894   .0609804     9.26   0.000     .4450582    .6841207
      gattnn |    .877027   .0910659     9.63   0.000     .6985232    1.055531
      gattfo |   .2288063   .0554498     4.13   0.000     .1201159    .3374967
      gattno |   .3449393   .0652702     5.28   0.000     .2169993    .4728792
         gsp |   .1816591   .0274623     6.61   0.000     .1278287    .2354896
    regional |   .7631499   .0705487    10.82   0.000     .6248632    .9014366
    custrict |   .6084905    .114918     5.29   0.000      .383233    .8337481
       lrgdp |   .4660196   .0463108    10.06   0.000      .375243    .5567961
     lrgdppc |   .2127972   .0445698     4.77   0.000     .1254333     .300161
      curcol |   .2834663   .1551634     1.83   0.068    -.0206786    .5876113
      yrdum2 |   .0110048   .0912835     0.12   0.904    -.1679254    .1899349
      yrdum3 |  -.2337311   .1301957    -1.80   0.073    -.4889354    .0214732
      yrdum4 |  -.0835441   .1302554    -0.64   0.521    -.3388655    .1717772
      yrdum5 |  -.1997953   .1308753    -1.53   0.127    -.4563317    .0567411
      yrdum6 |  -.3152851   .1314143    -2.40   0.016    -.5728781    -.057692
      yrdum7 |  -.2904319   .1321724    -2.20   0.028    -.5495109    -.031353
      yrdum8 |  -.2801287    .131835    -2.12   0.034    -.5385462   -.0217111
      yrdum9 |  -.2881881   .1319833    -2.18   0.029    -.5468963   -.0294799
     yrdum10 |  -.2532717   .1329775    -1.90   0.057    -.5139288    .0073854
     yrdum11 |  -.3514704   .1325633    -2.65   0.008    -.6113156   -.0916253
     yrdum12 |  -.3439156   .1332166    -2.58   0.010    -.6050415   -.0827898
     yrdum13 |  -.3804863   .1337649    -2.84   0.004    -.6426867   -.1182859
     yrdum14 |  -.4145924   .1340775    -3.09   0.002    -.6774057   -.1517792
     yrdum15 |   -.451367   .1347488    -3.35   0.001    -.7154962   -.1872379
     yrdum16 |  -.4227061   .1355069    -3.12   0.002    -.6883211    -.157091
     yrdum17 |  -.3455882   .1368185    -2.53   0.012    -.6137743   -.0774021
     yrdum18 |  -.3695234   .1373514    -2.69   0.007     -.638754   -.1002928
     yrdum19 |  -.3882623   .1379878    -2.81   0.005    -.6587403   -.1177844
     yrdum20 |  -.4359696   .1388363    -3.14   0.002    -.7081108   -.1638283
     yrdum21 |  -.5377995   .1394852    -3.86   0.000    -.8112127   -.2643864
     yrdum22 |  -.7990224   .1404506    -5.69   0.000    -1.074328   -.5237169
     yrdum23 |  -.8000949   .1412833    -5.66   0.000    -1.077033   -.5231572
     yrdum24 |  -.8522596   .1428096    -5.97   0.000    -1.132189   -.5723301
     yrdum25 |  -.7947232   .1434137    -5.54   0.000    -1.075837   -.5136095
     yrdum26 |  -.6308513   .1446386    -4.36   0.000    -.9143659   -.3473367
     yrdum27 |  -.4243194   .1456314    -2.91   0.004    -.7097802   -.1388587
     yrdum28 |  -.4892039   .1462373    -3.35   0.001    -.7758522   -.2025556
     yrdum29 |  -.5287826   .1472045    -3.59   0.000    -.8173268   -.2402385
     yrdum30 |  -.4742312     .14857    -3.19   0.001    -.7654519   -.1830104
     yrdum31 |  -.5031226   .1494562    -3.37   0.001    -.7960806   -.2101646
     yrdum32 |  -.4700719   .1503715    -3.13   0.002     -.764824   -.1753198
     yrdum33 |  -.4595021   .1512094    -3.04   0.002    -.7558965   -.1631076
     yrdum34 |  -.5781608   .1518086    -3.81   0.000    -.8757299   -.2805917
     yrdum35 |  -.7485886   .1525252    -4.91   0.000    -1.047562    -.449615
     yrdum36 |  -.8878025   .1535655    -5.78   0.000    -1.188815   -.5867896
     yrdum37 |   -.938565   .1543387    -6.08   0.000    -1.241094   -.6360365
     yrdum38 |  -.9929351   .1554777    -6.39   0.000    -1.297696    -.688174
     yrdum39 |  -1.039377    .156494    -6.64   0.000     -1.34613   -.7326238
     yrdum40 |  -1.016485     .15733    -6.46   0.000    -1.324876   -.7080926
     yrdum41 |  -.9711156    .158182    -6.14   0.000    -1.281178   -.6610537
     yrdum42 |  -.9689149   .1591893    -6.09   0.000    -1.280951   -.6568786
     yrdum43 |  -.9359214   .1600841    -5.85   0.000    -1.249712    -.622131
     yrdum44 |  -.9565406   .1611121    -5.94   0.000    -1.272346   -.6407352
     yrdum45 |  -.9136843   .1621217    -5.64   0.000    -1.231469   -.5958999
     yrdum46 |  -.9880344   .1625661    -6.08   0.000     -1.30669   -.6693789
     yrdum47 |  -.9053032    .163715    -5.53   0.000    -1.226211   -.5843958
     yrdum48 |  -.7802402   .1649197    -4.73   0.000    -1.103509   -.4569713
     yrdum49 |  -.7581788   .1657449    -4.57   0.000    -1.083065   -.4332923
     yrdum50 |  -.6959483   .1663827    -4.18   0.000    -1.022085   -.3698116
     yrdum51 |   -.449383   .1648937    -2.73   0.006    -.7726009   -.1261651
     yrdum52 |  -.5051807   .1656537    -3.05   0.002    -.8298884   -.1804731
       _cons |  -15.44505   1.512111   -10.21   0.000    -18.40903   -12.48107
-------------+----------------------------------------------------------------
        dyad |   absorbed                                   (12150 categories)

. estimates store t2c5

. fx_pct gattff gattfn gattnn gattfo gattno 
gattff: % increase in trade  61% with unrounded coeff,  62% with rounded coeff
gattfn: % increase in trade  76% with unrounded coeff,  75% with rounded coeff
gattnn: % increase in trade 140% with unrounded coeff, 141% with rounded coeff
gattfo: % increase in trade  26% with unrounded coeff,  26% with rounded coeff
gattno: % increase in trade  41% with unrounded coeff,  40% with rounded coeff

. 
. * Table 2, Column 6: PARTICIPATION x 2, YEAR AND DYADIC FIXED EFFECTS
. areg ltrade bothp onep gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52, a(d
> yad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  234597
                                                       F( 59, 12149) =  142.40
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8531
                                                       Adj R-squared =  0.8530
                                                       Root MSE      =  1.3134

                               (Std. Err. adjusted for 12150 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .5390714   .0585293     9.21   0.000     .4243445    .6537982
        onep |   .2657054   .0541007     4.91   0.000     .1596595    .3717514
         gsp |   .1900412   .0275134     6.91   0.000     .1361105    .2439719
    regional |   .7692498   .0714739    10.76   0.000     .6291495      .90935
    custrict |    .606803   .1137909     5.33   0.000     .3837547    .8298513
       lrgdp |   .4496952   .0460588     9.76   0.000     .3594126    .5399779
     lrgdppc |   .2248351   .0444702     5.06   0.000     .1376663    .3120038
      curcol |   .3085763    .154473     2.00   0.046     .0057845     .611368
      yrdum2 |   .0074086   .0909921     0.08   0.935    -.1709504    .1857676
      yrdum3 |  -.2209246   .1298279    -1.70   0.089     -.475408    .0335587
      yrdum4 |  -.0737204   .1298602    -0.57   0.570    -.3282671    .1808263
      yrdum5 |  -.1880418   .1304543    -1.44   0.149    -.4437531    .0676695
      yrdum6 |  -.2987536   .1309824    -2.28   0.023       -.5555   -.0420072
      yrdum7 |  -.2734357   .1317207    -2.08   0.038    -.5316292   -.0152422
      yrdum8 |   -.269033    .131395    -2.05   0.041    -.5265881    -.011478
      yrdum9 |  -.2761631   .1315299    -2.10   0.036    -.5339826   -.0183436
     yrdum10 |  -.2419893   .1325143    -1.83   0.068    -.5017385    .0177598
     yrdum11 |  -.3376925   .1320945    -2.56   0.011    -.5966188   -.0787662
     yrdum12 |  -.3272996   .1327513    -2.47   0.014    -.5875132    -.067086
     yrdum13 |  -.3475654   .1332407    -2.61   0.009    -.6087383   -.0863925
     yrdum14 |  -.3845268    .133575    -2.88   0.004    -.6463551   -.1226984
     yrdum15 |  -.4194277    .134204    -3.13   0.002     -.682489   -.1563664
     yrdum16 |  -.4062824   .1350196    -3.01   0.003    -.6709424   -.1416225
     yrdum17 |  -.3324136   .1363287    -2.44   0.015    -.5996396   -.0651876
     yrdum18 |  -.3558624   .1368774    -2.60   0.009    -.6241639   -.0875609
     yrdum19 |   -.382674   .1375107    -2.78   0.005    -.6522169   -.1131311
     yrdum20 |  -.4358144   .1383589    -3.15   0.002    -.7070199   -.1646089
     yrdum21 |  -.5370715   .1390063    -3.86   0.000     -.809546   -.2645969
     yrdum22 |  -.7962841   .1399813    -5.69   0.000     -1.07067   -.5218986
     yrdum23 |  -.8004174   .1408164    -5.68   0.000     -1.07644   -.5243949
     yrdum24 |  -.8561532   .1423401    -6.01   0.000    -1.135162    -.577144
     yrdum25 |  -.7985568   .1429712    -5.59   0.000    -1.078803   -.5183104
     yrdum26 |  -.6350183   .1441953    -4.40   0.000     -.917664   -.3523727
     yrdum27 |  -.4274184   .1451931    -2.94   0.003      -.71202   -.1428169
     yrdum28 |  -.4900093   .1457931    -3.36   0.001     -.775787   -.2042316
     yrdum29 |   -.527173   .1467796    -3.59   0.000    -.8148845   -.2394616
     yrdum30 |   -.471183   .1481299    -3.18   0.001    -.7615412   -.1808249
     yrdum31 |  -.5004814   .1489992    -3.36   0.001    -.7925434   -.2084193
     yrdum32 |  -.4690647   .1499302    -3.13   0.002    -.7629518   -.1751777
     yrdum33 |  -.4575553   .1507701    -3.03   0.002    -.7530887   -.1620219
     yrdum34 |  -.5778076   .1513646    -3.82   0.000    -.8745062   -.2811089
     yrdum35 |  -.7501769   .1520844    -4.93   0.000    -1.048287   -.4520672
     yrdum36 |  -.8896799   .1531349    -5.81   0.000    -1.189849   -.5895111
     yrdum37 |  -.9400681   .1539176    -6.11   0.000    -1.241771   -.6383651
     yrdum38 |  -.9935895   .1550366    -6.41   0.000    -1.297486    -.689693
     yrdum39 |  -1.043021   .1560651    -6.68   0.000    -1.348934   -.7371089
     yrdum40 |  -1.020679   .1568841    -6.51   0.000    -1.328196   -.7131608
     yrdum41 |  -.9747746   .1577509    -6.18   0.000    -1.283991   -.6655577
     yrdum42 |    -.97131   .1587355    -6.12   0.000    -1.282457   -.6601631
     yrdum43 |  -.9415139   .1596587    -5.90   0.000     -1.25447   -.6285574
     yrdum44 |  -.9620614   .1606948    -5.99   0.000    -1.277049    -.647074
     yrdum45 |   -.919819   .1616751    -5.69   0.000    -1.236728   -.6029101
     yrdum46 |  -.9997221   .1621171    -6.17   0.000    -1.317498   -.6819467
     yrdum47 |  -.9243154   .1632103    -5.66   0.000    -1.244234   -.6043973
     yrdum48 |  -.7985225   .1644074    -4.86   0.000    -1.120787   -.4762578
     yrdum49 |  -.7764369   .1652036    -4.70   0.000    -1.100262   -.4526115
     yrdum50 |  -.7177997   .1658111    -4.33   0.000    -1.042816   -.3927836
     yrdum51 |  -.4722933   .1642931    -2.87   0.004    -.7943339   -.1502526
     yrdum52 |  -.5267697   .1650378    -3.19   0.001    -.8502701   -.2032693
       _cons |  -14.88401   1.503075    -9.90   0.000    -17.83027   -11.93774
-------------+----------------------------------------------------------------
        dyad |   absorbed                                   (12150 categories)

. estimates store t2c6

. fx_pct bothp onep  
bothp: % increase in trade  71% with unrounded coeff,  72% with rounded coeff
onep: % increase in trade  30% with unrounded coeff,  31% with rounded coeff

. di "How much higher % when both participate? " %7.2f 100*(exp(_b[bothp] - _b[onep]) -
>  1) 
How much higher % when both participate?   31.44

. di "Same quantity using rounded coefficients " %7.2f 100*(exp(round(_b[bothp],.01) - 
> round(_b[onep],.01)) - 1) 
Same quantity using rounded coefficients   31.00

. 
. * Table 2, Column 7: PARTICIPATION x 2 with Article 35, YEAR AND DYADIC FIXED EFFECTS
. areg ltrade bothp onep both35 one35 gsp regional custrict lrgdp lrgdppc curcol yrdum2
> -yrdum52, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  234597
                                                       F( 61, 12149) =  137.96
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8531
                                                       Adj R-squared =  0.8531
                                                       Root MSE      =  1.3131

                               (Std. Err. adjusted for 12150 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .5438114     .05856     9.29   0.000     .4290244    .6585984
        onep |   .2658986   .0541061     4.91   0.000     .1598419    .3719553
      both35 |  -1.875014   .6164866    -3.04   0.002    -3.083426    -.666602
       one35 |  -.2457093   .1398288    -1.76   0.079     -.519796    .0283773
         gsp |   .1876215   .0275245     6.82   0.000      .133669    .2415739
    regional |   .7706113   .0714017    10.79   0.000     .6306526    .9105699
    custrict |   .6057778    .113788     5.32   0.000     .3827351    .8288205
       lrgdp |   .4502159   .0460255     9.78   0.000     .3599985    .5404332
     lrgdppc |   .2231129   .0444068     5.02   0.000     .1360686    .3101573
      curcol |   .3063202   .1545915     1.98   0.048     .0032962    .6093443
      yrdum2 |   .0070248   .0909646     0.08   0.938    -.1712802    .1853298
      yrdum3 |  -.2238634    .129761    -1.73   0.085    -.4782157    .0304889
      yrdum4 |  -.0779585   .1297995    -0.60   0.548    -.3323861    .1764691
      yrdum5 |   -.192261   .1303917    -1.47   0.140    -.4478496    .0633276
      yrdum6 |  -.3028397    .130918    -2.31   0.021    -.5594599   -.0462194
      yrdum7 |  -.2774824   .1316568    -2.11   0.035    -.5355507    -.019414
      yrdum8 |   -.269438   .1313379    -2.05   0.040    -.5268812   -.0119949
      yrdum9 |  -.2765721   .1314771    -2.10   0.035    -.5342881   -.0188561
     yrdum10 |  -.2417562   .1324623    -1.83   0.068    -.5014035    .0178911
     yrdum11 |  -.3373558   .1320452    -2.55   0.011    -.5961854   -.0785261
     yrdum12 |  -.3271655   .1326941    -2.47   0.014    -.5872671   -.0670639
     yrdum13 |  -.3464697   .1331953    -2.60   0.009    -.6075538   -.0853857
     yrdum14 |   -.383306   .1335306    -2.87   0.004    -.6450471   -.1215648
     yrdum15 |  -.4172524   .1341645    -3.11   0.002    -.6802363   -.1542685
     yrdum16 |  -.4042862   .1349769    -3.00   0.003    -.6688625     -.13971
     yrdum17 |  -.3305526   .1362858    -2.43   0.015    -.5976944   -.0634108
     yrdum18 |  -.3547017   .1368289    -2.59   0.010    -.6229081   -.0864953
     yrdum19 |  -.3815667   .1374626    -2.78   0.006    -.6510152   -.1121182
     yrdum20 |  -.4348996   .1383099    -3.14   0.002     -.706009   -.1637902
     yrdum21 |  -.5362794   .1389571    -3.86   0.000    -.8086575   -.2639013
     yrdum22 |  -.7954584   .1399291    -5.68   0.000    -1.069742   -.5211751
     yrdum23 |  -.7996368   .1407654    -5.68   0.000    -1.075559   -.5237141
     yrdum24 |  -.8551349   .1422884    -6.01   0.000    -1.134043    -.576227
     yrdum25 |  -.7976587   .1429204    -5.58   0.000    -1.077805    -.517512
     yrdum26 |  -.6344089   .1441444    -4.40   0.000    -.9169548    -.351863
     yrdum27 |  -.4268252   .1451427    -2.94   0.003    -.7113281   -.1423223
     yrdum28 |  -.4900141   .1457395    -3.36   0.001    -.7756867   -.2043416
     yrdum29 |  -.5274222   .1467228    -3.59   0.000    -.8150224   -.2398221
     yrdum30 |  -.4713093   .1480716    -3.18   0.001    -.7615531   -.1810654
     yrdum31 |  -.5005787   .1489405    -3.36   0.001    -.7925257   -.2086316
     yrdum32 |  -.4691258   .1498714    -3.13   0.002    -.7628976   -.1753541
     yrdum33 |  -.4576073   .1507094    -3.04   0.002    -.7530218   -.1621929
     yrdum34 |  -.5780126    .151303    -3.82   0.000    -.8745906   -.2814347
     yrdum35 |  -.7504831   .1520214    -4.94   0.000    -1.048469   -.4524969
     yrdum36 |  -.8900192   .1530701    -5.81   0.000    -1.190061   -.5899775
     yrdum37 |  -.9403833   .1538535    -6.11   0.000    -1.241961   -.6388061
     yrdum38 |  -.9938974   .1549723    -6.41   0.000    -1.297668   -.6901271
     yrdum39 |  -1.043345   .1560012    -6.69   0.000    -1.349132   -.7375575
     yrdum40 |  -1.021172   .1568187    -6.51   0.000    -1.328561    -.713782
     yrdum41 |  -.9755758    .157686    -6.19   0.000    -1.284665   -.6664861
     yrdum42 |  -.9724592   .1586698    -6.13   0.000    -1.283477   -.6614412
     yrdum43 |  -.9427912   .1595909    -5.91   0.000    -1.255615   -.6299676
     yrdum44 |   -.963503   .1606247    -6.00   0.000    -1.278353   -.6486529
     yrdum45 |  -.9212767   .1616042    -5.70   0.000    -1.238047   -.6045066
     yrdum46 |  -1.001195   .1620456    -6.18   0.000    -1.318831   -.6835602
     yrdum47 |  -.9261151    .163133    -5.68   0.000    -1.245882   -.6063484
     yrdum48 |  -.8003919   .1643278    -4.87   0.000    -1.122501   -.4782832
     yrdum49 |  -.7783986    .165123    -4.71   0.000    -1.102066   -.4547312
     yrdum50 |  -.7198023    .165729    -4.34   0.000    -1.044658    -.394947
     yrdum51 |  -.4748056   .1642017    -2.89   0.004    -.7966671   -.1529441
     yrdum52 |  -.5293126   .1649469    -3.21   0.001    -.8526347   -.2059905
       _cons |  -14.88192   1.502643    -9.90   0.000    -17.82734    -11.9365
-------------+----------------------------------------------------------------
        dyad |   absorbed                                   (12150 categories)

. estimates store t2c7

. di "Percentage effects when no one invokes article 35:" 
Percentage effects when no one invokes article 35:

. fx_pct bothp onep
bothp: % increase in trade  72% with unrounded coeff,  72% with rounded coeff
onep: % increase in trade  30% with unrounded coeff,  31% with rounded coeff

. di "Bothp when one invokes article 35: " %7.2f 100*(exp(_b[bothp] + _b[one35]) - 1)
Bothp when one invokes article 35:   34.73

. di "Same quantity using rounded coeffs: " %7.2f 100*(exp( round(_b[bothp],.01) + roun
> d(_b[one35],.01) ) - 1)
Same quantity using rounded coeffs:   33.64

. di "Bothp when both invoke article 35: " %7.2f 100*(exp(_b[bothp] + _b[both35]) - 1)
Bothp when both invoke article 35:  -73.58

. di "Same quantity using rounced coeffs: " %7.2f 100*(exp( round(_b[bothp],.01) + roun
> d(_b[both35],.01) ) - 1)
Same quantity using rounced coeffs:  -73.82

. tab art35  

      GATT: |
     Either |
    invokes |
       XXXV |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    233,608       99.58       99.58
          1 |        989        0.42      100.00
------------+-----------------------------------
      Total |    234,597      100.00

. tab art351 art352 

   GATT: 1 |
    wholds |    GATT: 2 wholds
  benefits |    benefits from 1
    from 2 |         0          1 |     Total
-----------+----------------------+----------
         0 |   233,608        821 |   234,429 
         1 |       109         59 |       168 
-----------+----------------------+----------
     Total |   233,717        880 |   234,597 


. 
. * Print Table 2
. estimates table t2c1 t2c2, se b(%5.2f) stats(rmse r2) stfmt(%5.3f) keep(bothin onein 
> gattff gattfo gsp regional custrict curcol lrgdp lrgdppc ldist comlang border landl i
> sland lareap comcol colony comctry)

----------------------------------
    Variable |  t2c1      t2c2    
-------------+--------------------
      bothin |   -0.04            
             |    0.05            
       onein |   -0.06            
             |    0.05            
      gattff |             -0.17  
             |              0.03  
      gattfo |             -0.27  
             |              0.04  
         gsp |    0.86      0.86  
             |    0.03      0.03  
    regional |    1.20      1.20  
             |    0.11      0.11  
    custrict |    1.12      1.15  
             |    0.12      0.12  
      curcol |    1.08      0.98  
             |    0.23      0.23  
       lrgdp |    0.92      0.92  
             |    0.01      0.01  
     lrgdppc |    0.32      0.32  
             |    0.01      0.01  
       ldist |   -1.12     -1.12  
             |    0.02      0.02  
     comlang |    0.31      0.30  
             |    0.04      0.04  
      border |    0.53      0.51  
             |    0.11      0.11  
       landl |   -0.27     -0.27  
             |    0.03      0.03  
      island |    0.04      0.03  
             |    0.04      0.04  
      lareap |   -0.10     -0.10  
             |    0.01      0.01  
      comcol |    0.58      0.56  
             |    0.07      0.07  
      colony |    1.16      1.16  
             |    0.12      0.12  
     comctry |   -0.02     -0.03  
             |    1.08      1.07  
-------------+--------------------
        rmse |   1.980     1.978  
          r2 |   0.648     0.649  
----------------------------------
                      legend: b/se

. estimates table t2c3 t2c4 t2c5 t2c6 t2c7, se b(%5.2f) stats(rmse r2) stfmt(%5.3f) kee
> p(gattff gattfn gattnn bothp gattfo gattno onep both35 one35 gsp regional custrict cu
> rcol lrgdp lrgdppc ldist comlang border landl island lareap comcol colony comctry)

----------------------------------------------------------------
    Variable |  t2c3      t2c4      t2c5      t2c6      t2c7    
-------------+--------------------------------------------------
      gattff |    0.17      0.54      0.48                      
             |    0.07      0.06      0.06                      
      gattfn |    0.41      0.64      0.56                      
             |    0.07      0.06      0.06                      
      gattnn |    0.80      0.86      0.88                      
             |    0.14      0.12      0.09                      
       bothp |                                  0.54      0.54  
             |                                  0.06      0.06  
      gattfo |    0.06      0.24      0.23                      
             |    0.07      0.06      0.06                      
      gattno |    0.33      0.40      0.34                      
             |    0.09      0.08      0.07                      
        onep |                                  0.27      0.27  
             |                                  0.05      0.05  
      both35 |                                           -1.88  
             |                                            0.62  
       one35 |                                           -0.25  
             |                                            0.14  
         gsp |    0.85      0.70      0.18      0.19      0.19  
             |    0.03      0.03      0.03      0.03      0.03  
    regional |    1.19      0.94      0.76      0.77      0.77  
             |    0.11      0.13      0.07      0.07      0.07  
    custrict |    1.11      1.17      0.61      0.61      0.61  
             |    0.12      0.12      0.11      0.11      0.11  
      curcol |    0.94      0.73      0.28      0.31      0.31  
             |    0.23      0.26      0.16      0.15      0.15  
       lrgdp |    0.93      0.18      0.47      0.45      0.45  
             |    0.01      0.05      0.05      0.05      0.05  
     lrgdppc |    0.31      0.52      0.21      0.22      0.22  
             |    0.01      0.05      0.04      0.04      0.04  
       ldist |   -1.13     -1.31                                
             |    0.02      0.02                                
     comlang |    0.31      0.27                                
             |    0.04      0.04                                
      border |    0.52      0.28                                
             |    0.11      0.11                                
       landl |   -0.27     -1.53                                
             |    0.03      0.32                                
      island |    0.02     -1.03                                
             |    0.04      0.19                                
      lareap |   -0.09      0.37                                
             |    0.01      0.03                                
      comcol |    0.52      0.60                                
             |    0.07      0.06                                
      colony |    1.15      1.28                                
             |    0.12      0.11                                
     comctry |   -0.02      0.32                                
             |    1.07      0.58                                
-------------+--------------------------------------------------
        rmse |   1.976     1.817     1.313     1.313     1.313  
          r2 |   0.649     0.704     0.853     0.853     0.853  
----------------------------------------------------------------
                                                    legend: b/se

. estimates stats t2c1 t2c2 t2c3 t2c4 t2c5 t2c6 t2c7

------------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+----------------------------------------------------------------
        t2c1 |  234597  -612611.2   -493047.6     18     986131.1    986317.7
        t2c2 |  234597  -612611.2     -492802     18     985639.9    985826.5
        t2c3 |  234597  -612611.2     -492571     21       985184    985401.7
        t2c4 |  234597  -612611.2   -472892.5    195     946175.1    948196.4
        t2c5 |  234597  -406381.9   -390475.5     62     781074.9    781717.6
        t2c6 |  234597  -406381.9   -390558.3     59     781234.7    781846.3
        t2c7 |  234597  -406381.9   -390516.5     61       781155    781787.3
------------------------------------------------------------------------------

. 
. * FOOTNOTE: DID PARTNER SIGN DECLARATION OF PROVISIONAL ACCESSION?
. * STANFORD MEMBERSHIP x 2 with Provisional Non-Acceptance and Article 35, YEAR AND DY
> ADIC FIXED EFFECTS
. areg ltrade bothp onep gattnop both35 one35 gsp regional custrict lrgdp lrgdppc curco
> l yrdum2-yrdum52, a(dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  234597
                                                       F( 62, 12149) =  135.99
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8531
                                                       Adj R-squared =  0.8531
                                                       Root MSE      =  1.3131

                               (Std. Err. adjusted for 12150 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .5505837   .0585695     9.40   0.000     .4357781    .6653894
        onep |   .2679931   .0540591     4.96   0.000     .1620286    .3739576
     gattnop |  -.1762608   .0716508    -2.46   0.014    -.3167078   -.0358137
      both35 |  -1.877999   .6164111    -3.05   0.002    -3.086263    -.669735
       one35 |  -.2519131   .1397473    -1.80   0.071      -.52584    .0220138
         gsp |   .1882291   .0275172     6.84   0.000     .1342909    .2421672
    regional |   .7715419   .0713508    10.81   0.000     .6316831    .9114008
    custrict |   .6045966   .1137455     5.32   0.000     .3816373     .827556
       lrgdp |   .4499013   .0460196     9.78   0.000     .3596955    .5401071
     lrgdppc |   .2231919   .0443993     5.03   0.000     .1361623    .3102215
      curcol |   .3053789   .1546583     1.97   0.048      .002224    .6085337
      yrdum2 |   .0068807   .0909253     0.08   0.940    -.1713474    .1851088
      yrdum3 |  -.2234064   .1297636    -1.72   0.085    -.4777638     .030951
      yrdum4 |  -.0780958   .1297979    -0.60   0.547    -.3325204    .1763288
      yrdum5 |  -.1924704   .1303842    -1.48   0.140    -.4480442    .0631034
      yrdum6 |  -.2995518   .1308969    -2.29   0.022    -.5561305    -.042973
      yrdum7 |  -.2757943   .1316369    -2.10   0.036    -.5338236   -.0177651
      yrdum8 |  -.2697261   .1313257    -2.05   0.040    -.5271454   -.0123067
      yrdum9 |  -.2768718   .1314627    -2.11   0.035    -.5345597    -.019184
     yrdum10 |  -.2419393   .1324508    -1.83   0.068     -.501564    .0176854
     yrdum11 |  -.3375064   .1320305    -2.56   0.011    -.5963073   -.0787056
     yrdum12 |   -.326509   .1326747    -2.46   0.014    -.5865726   -.0664455
     yrdum13 |  -.3449123   .1331702    -2.59   0.010    -.6059471   -.0838776
     yrdum14 |  -.3822479   .1335089    -2.86   0.004    -.6439467   -.1205491
     yrdum15 |  -.4158708   .1341387    -3.10   0.002     -.678804   -.1529375
     yrdum16 |  -.4010758   .1349594    -2.97   0.003    -.6656178   -.1365339
     yrdum17 |  -.3279134   .1362703    -2.41   0.016    -.5950249    -.060802
     yrdum18 |  -.3525891   .1368119    -2.58   0.010    -.6207622   -.0844159
     yrdum19 |  -.3808246   .1374453    -2.77   0.006    -.6502393   -.1114099
     yrdum20 |  -.4351788    .138295    -3.15   0.002    -.7062591   -.1640986
     yrdum21 |  -.5367966   .1389421    -3.86   0.000    -.8091453    -.264448
     yrdum22 |  -.7959072   .1399119    -5.69   0.000    -1.070157   -.5216576
     yrdum23 |  -.8006162   .1407473    -5.69   0.000    -1.076503   -.5247291
     yrdum24 |  -.8562892   .1422675    -6.02   0.000    -1.135156   -.5774224
     yrdum25 |  -.7988269      .1429    -5.59   0.000    -1.078934   -.5187203
     yrdum26 |  -.6337518   .1441167    -4.40   0.000    -.9162434   -.3512602
     yrdum27 |  -.4264889   .1451256    -2.94   0.003    -.7109582   -.1420195
     yrdum28 |  -.4897019   .1457144    -3.36   0.001    -.7753252   -.2040785
     yrdum29 |  -.5253344   .1466922    -3.58   0.000    -.8128746   -.2377943
     yrdum30 |  -.4691768   .1480403    -3.17   0.002    -.7593595   -.1789942
     yrdum31 |  -.4983014   .1489021    -3.35   0.001    -.7901732   -.2064296
     yrdum32 |  -.4685727   .1498375    -3.13   0.002     -.762278   -.1748675
     yrdum33 |  -.4570881   .1506759    -3.03   0.002    -.7524369   -.1617393
     yrdum34 |  -.5794209   .1512745    -3.83   0.000     -.875943   -.2828989
     yrdum35 |  -.7519732   .1519915    -4.95   0.000    -1.049901   -.4540457
     yrdum36 |  -.8913828   .1530359    -5.82   0.000    -1.191358    -.591408
     yrdum37 |  -.9418223   .1538194    -6.12   0.000    -1.243333   -.6403118
     yrdum38 |  -.9952435   .1549392    -6.42   0.000    -1.298949    -.691538
     yrdum39 |  -1.044725   .1559674    -6.70   0.000    -1.350446   -.7390046
     yrdum40 |  -1.022517   .1567846    -6.52   0.000     -1.32984   -.7151942
     yrdum41 |  -.9769282   .1576522    -6.20   0.000    -1.285952   -.6679049
     yrdum42 |  -.9737403    .158637    -6.14   0.000    -1.284694   -.6627866
     yrdum43 |  -.9453389   .1595589    -5.92   0.000      -1.2581    -.632578
     yrdum44 |  -.9661009   .1605924    -6.02   0.000    -1.280888   -.6513143
     yrdum45 |  -.9238036   .1615732    -5.72   0.000    -1.240513   -.6070944
     yrdum46 |  -1.003652   .1620136    -6.19   0.000    -1.321225   -.6860797
     yrdum47 |  -.9288362      .1631    -5.69   0.000    -1.248538   -.6091343
     yrdum48 |  -.8031177    .164296    -4.89   0.000    -1.125164   -.4810713
     yrdum49 |  -.7812144   .1650903    -4.73   0.000    -1.104818   -.4576111
     yrdum50 |   -.722473   .1656961    -4.36   0.000    -1.047264   -.3976823
     yrdum51 |   -.477535   .1641692    -2.91   0.004    -.7993328   -.1557372
     yrdum52 |  -.5320715   .1649137    -3.23   0.001    -.8553286   -.2088144
       _cons |  -14.87135   1.502484    -9.90   0.000    -17.81645   -11.92624
-------------+----------------------------------------------------------------
        dyad |   absorbed                                   (12150 categories)

. fx_pct bothp onep
bothp: % increase in trade  73% with unrounded coeff,  73% with rounded coeff
onep: % increase in trade  31% with unrounded coeff,  31% with rounded coeff

. di "Bothp when one does not sign provisional protocol: " %7.2f 100*(exp(_b[bothp] + _
> b[gattnop]) - 1)  /* delete? */
Bothp when one does not sign provisional protocol:   45.40

. di "Same quantity when use rounded coefficients: " %7.2f 100*(exp( round(_b[bothp],.0
> 1) + round(_b[gattnop],.01) ) - 1)  /* delete? */
Same quantity when use rounded coefficients:   44.77

. 
. log close
       log:  /afs/ir.stanford.edu/users/t/o/tomz/AER2007/table2.log
  log type:  text
 closed on:  18 Jun 2007, 22:34:53
---------------------------------------------------------------------------------------
