---------------------------------------------------------------------------------------
       log:  /afs/ir.stanford.edu/users/t/o/tomz/AER2007/table5.log
  log type:  text
 opened on:  18 Jun 2007, 23:16:18

. 
. ***********************************
. * TOMZ, GOLDSTEIN, RIVERS TABLE 5 *
. ***********************************
. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1950, robust

Linear regression                                      Number of obs =    1115
                                                       F( 14,  1100) =  249.43
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6886
                                                       Root MSE      =  1.1266

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .6027846   .1034677     5.83   0.000     .3997683    .8058008
        onep |   .2639654    .091816     2.87   0.004     .0838112    .4441195
         gsp |  (dropped)
    regional |  (dropped)
    custrict |   .8928363    .302321     2.95   0.003     .2996453    1.486027
       ldist |  -.7207933   .0449411   -16.04   0.000    -.8089733   -.6326134
       lrgdp |   .6722532   .0222157    30.26   0.000     .6286633    .7158432
     lrgdppc |   .3072312   .0374824     8.20   0.000     .2336862    .3807763
     comlang |   .0687015   .0916213     0.75   0.454    -.1110708    .2484737
      border |   .1223134   .1787201     0.68   0.494    -.2283574    .4729843
       landl |  -.0548995   .0866753    -0.63   0.527    -.2249672    .1151681
      island |   .2252013   .0857734     2.63   0.009     .0569034    .3934993
      lareap |   .0068854    .020685     0.33   0.739    -.0337011    .0474719
      comcol |    .378419   .2861825     1.32   0.186    -.1831063    .9399443
      curcol |   1.201379   .3903434     3.08   0.002     .4354772    1.967281
      colony |   .6364898   .2514362     2.53   0.011     .1431412    1.129838
     comctry |  (dropped)
       _cons |  -20.08708   .8347563   -24.06   0.000    -21.72498   -18.44919
------------------------------------------------------------------------------

. estimates store t5r1

. fx_pct bothp onep
bothp: % increase in trade  83% with unrounded coeff,  82% with rounded coeff
onep: % increase in trade  30% with unrounded coeff,  30% with rounded coeff

. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1955, robust

Linear regression                                      Number of obs =    1468
                                                       F( 14,  1453) =  314.79
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6952
                                                       Root MSE      =  1.1625

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .7870232   .1131511     6.96   0.000     .5650662     1.00898
        onep |   .4002801   .1083593     3.69   0.000     .1877227    .6128374
         gsp |  (dropped)
    regional |  (dropped)
    custrict |   .9882721   .2458083     4.02   0.000      .506095    1.470449
       ldist |  -.7004465   .0447222   -15.66   0.000    -.7881735   -.6127196
       lrgdp |   .6980907   .0207043    33.72   0.000     .6574772    .7387041
     lrgdppc |   .3562525   .0337778    10.55   0.000      .289994    .4225111
     comlang |     .04844   .0830572     0.58   0.560    -.1144847    .2113648
      border |   .0205509   .2109989     0.10   0.922    -.3933442     .434446
       landl |   .0326155   .0711302     0.46   0.647    -.1069134    .1721444
      island |   .1039487     .07383     1.41   0.159    -.0408762    .2487735
      lareap |  -.0567154    .018282    -3.10   0.002    -.0925774   -.0208534
      comcol |   .4097669   .2427488     1.69   0.092    -.0664087    .8859425
      curcol |   1.453402   .3103963     4.68   0.000     .8445288    2.062274
      colony |     .58105   .2309796     2.52   0.012     .1279609    1.034139
     comctry |  (dropped)
       _cons |  -21.03715   .7881264   -26.69   0.000    -22.58314   -19.49117
------------------------------------------------------------------------------

. estimates store t5r2

. fx_pct bothp onep
bothp: % increase in trade 120% with unrounded coeff, 120% with rounded coeff
onep: % increase in trade  49% with unrounded coeff,  49% with rounded coeff

. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1960, robust

Linear regression                                      Number of obs =    2625
                                                       F( 16,  2608) =  467.24
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6286
                                                       Root MSE      =  1.2691

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .4833982   .1025653     4.71   0.000     .2822806    .6845159
        onep |   .3097202   .0983972     3.15   0.002     .1167757    .5026648
         gsp |  (dropped)
    regional |     .30938   .1493241     2.07   0.038     .0165743    .6021857
    custrict |   .6443116   .1758972     3.66   0.000     .2993993    .9892238
       ldist |  -.6987691   .0354894   -19.69   0.000    -.7683594   -.6291788
       lrgdp |   .6795223   .0163307    41.61   0.000     .6474999    .7115446
     lrgdppc |   .3212689   .0277049    11.60   0.000      .266943    .3755947
     comlang |   .2201724   .0682047     3.23   0.001     .0864315    .3539132
      border |    .268674   .1556971     1.73   0.085    -.0366284    .5739764
       landl |  -.1897382   .0571513    -3.32   0.001    -.3018046   -.0776717
      island |   .1274271   .0574089     2.22   0.027     .0148554    .2399987
      lareap |   -.076577   .0122081    -6.27   0.000    -.1005156   -.0526385
      comcol |    .756294     .12744     5.93   0.000     .5064002    1.006188
      curcol |   1.223865   .2910029     4.21   0.000     .6532452    1.794485
      colony |   .9804179   .2143234     4.57   0.000     .5601566    1.400679
     comctry |   .3618887   .8060953     0.45   0.654    -1.218763     1.94254
       _cons |  -19.22379   .6660906   -28.86   0.000    -20.52991   -17.91767
------------------------------------------------------------------------------

. estimates store t5r3

. fx_pct bothp onep
bothp: % increase in trade  62% with unrounded coeff,  62% with rounded coeff
onep: % increase in trade  36% with unrounded coeff,  36% with rounded coeff

. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1965, robust

Linear regression                                      Number of obs =    3361
                                                       F( 16,  3344) =  416.74
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6512
                                                       Root MSE      =  1.3289

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .3776279   .1055644     3.58   0.000     .1706505    .5846053
        onep |   .2563745   .1072349     2.39   0.017     .0461218    .4666272
         gsp |  (dropped)
    regional |   1.389837   .1929117     7.20   0.000       1.0116    1.768074
    custrict |    .810155   .1549066     5.23   0.000     .5064337    1.113876
       ldist |  -.7382999   .0336378   -21.95   0.000    -.8042526   -.6723472
       lrgdp |   .7201426   .0151111    47.66   0.000     .6905147    .7497705
     lrgdppc |   .2997876   .0246029    12.19   0.000     .2515494    .3480258
     comlang |   .2221983   .0605849     3.67   0.000     .1034111    .3409855
      border |   .3008288   .1326352     2.27   0.023     .0407744    .5608833
       landl |   .0363655   .0493838     0.74   0.462      -.06046    .1331911
      island |   .2352128    .055043     4.27   0.000     .1272915    .3431341
      lareap |  -.0569493     .01119    -5.09   0.000    -.0788893   -.0350093
      comcol |   .6099106   .1033071     5.90   0.000      .407359    .8124622
      curcol |   1.422263   .3250011     4.38   0.000      .785042    2.059484
      colony |    1.23068   .1633712     7.53   0.000     .9103621    1.550997
     comctry |  -.4529978   1.104801    -0.41   0.682    -2.619152    1.713156
       _cons |  -21.31115   .6029275   -35.35   0.000    -22.49329     -20.129
------------------------------------------------------------------------------

. estimates store t5r4

. fx_pct bothp onep
bothp: % increase in trade  46% with unrounded coeff,  46% with rounded coeff
onep: % increase in trade  29% with unrounded coeff,  30% with rounded coeff

. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1970, robust

Linear regression                                      Number of obs =    4737
                                                       F( 17,  4719) =  562.15
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6513
                                                       Root MSE      =  1.7551

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .3966158   .1244061     3.19   0.001     .1527218    .6405098
        onep |   .2015114   .1254956     1.61   0.108    -.0445185    .4475413
         gsp |   .3672283   .2255226     1.63   0.104    -.0749013    .8093579
    regional |   1.473234   .3984569     3.70   0.000     .6920723    2.254395
    custrict |   1.357637   .2122775     6.40   0.000     .9414739      1.7738
       ldist |  -.9684403   .0358813   -26.99   0.000    -1.038784   -.8980962
       lrgdp |   .9133167   .0159514    57.26   0.000     .8820446    .9445889
     lrgdppc |   .3935239   .0259761    15.15   0.000     .3425986    .4444493
     comlang |   .3746127   .0674364     5.56   0.000      .242406    .5068195
      border |   .5666392   .1627777     3.48   0.001     .2475188    .8857595
       landl |   .0167009   .0583438     0.29   0.775    -.0976802    .1310819
      island |  -.0101371   .0625075    -0.16   0.871    -.1326811    .1124068
      lareap |  -.1337202   .0130289   -10.26   0.000    -.1592629   -.1081775
      comcol |   .5760477   .1075345     5.36   0.000     .3652299    .7868654
      curcol |   1.266424   .4644846     2.73   0.006     .3558171    2.177031
      colony |   1.390047   .1581978     8.79   0.000     1.079906    1.700189
     comctry |   .3037559    .811907     0.37   0.708    -1.287961    1.895473
       _cons |  -29.08403    .625898   -46.47   0.000    -30.31108   -27.85698
------------------------------------------------------------------------------

. estimates store t5r5

. fx_pct bothp onep
bothp: % increase in trade  49% with unrounded coeff,  49% with rounded coeff
onep: % increase in trade  22% with unrounded coeff,  22% with rounded coeff

. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1975, robust

Linear regression                                      Number of obs =    5354
                                                       F( 17,  5336) =  598.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6455
                                                       Root MSE      =  1.8341

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |    .223918   .1471743     1.52   0.128    -.0646037    .5124397
        onep |   .1400826   .1499062     0.93   0.350    -.1537948    .4339601
         gsp |   .8564902   .0530461    16.15   0.000     .7524982    .9604821
    regional |   .9835911    .205162     4.79   0.000     .5813897    1.385792
    custrict |   1.129421   .2376009     4.75   0.000     .6636257    1.595215
       ldist |  -1.124131   .0372343   -30.19   0.000    -1.197125   -1.051136
       lrgdp |   .8592927   .0158903    54.08   0.000     .8281412    .8904441
     lrgdppc |   .3608552    .024977    14.45   0.000       .31189    .4098205
     comlang |   .3116223   .0673638     4.63   0.000     .1795619    .4436828
      border |   .4429833   .1533388     2.89   0.004     .1423765    .7435901
       landl |  -.2502335   .0570658    -4.38   0.000    -.3621059   -.1383611
      island |   .0861655   .0585581     1.47   0.141    -.0286322    .2009633
      lareap |  -.0549401   .0126998    -4.33   0.000    -.0798368   -.0300433
      comcol |   .6095772   .1124103     5.42   0.000      .389207    .8299474
      curcol |   .6168645   .6279497     0.98   0.326    -.6141735    1.847903
      colony |   1.457031   .1441398    10.11   0.000     1.174458    1.739604
     comctry |   .7147622   1.421526     0.50   0.615     -2.07201    3.501535
       _cons |  -26.60022    .636548   -41.79   0.000    -27.84811   -25.35232
------------------------------------------------------------------------------

. estimates store t5r6

. fx_pct bothp onep
bothp: % increase in trade  25% with unrounded coeff,  25% with rounded coeff
onep: % increase in trade  15% with unrounded coeff,  15% with rounded coeff

. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1980, robust

Linear regression                                      Number of obs =    5895
                                                       F( 17,  5877) =  695.18
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6521
                                                       Root MSE      =  1.9179

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .4003762   .1637789     2.44   0.015     .0793093    .7214432
        onep |   .3569784   .1659197     2.15   0.031     .0317148    .6822419
         gsp |   .8622556   .0533191    16.17   0.000     .7577306    .9667806
    regional |   1.364681   .1740082     7.84   0.000     1.023561    1.705801
    custrict |    .862684   .2379975     3.62   0.000     .3961214    1.329247
       ldist |  -1.153615   .0371379   -31.06   0.000    -1.226419   -1.080811
       lrgdp |   .8913751   .0152825    58.33   0.000     .8614159    .9213343
     lrgdppc |   .3580197    .024477    14.63   0.000     .3100358    .4060035
     comlang |    .235541   .0680219     3.46   0.001      .102193    .3688889
      border |   .6819468   .1595117     4.28   0.000     .3692452    .9946485
       landl |  -.2768998   .0594254    -4.66   0.000    -.3933955   -.1604042
      island |   .0394572   .0565393     0.70   0.485    -.0713806     .150295
      lareap |  -.0921422   .0124042    -7.43   0.000     -.116459   -.0678254
      comcol |    .562677   .1103425     5.10   0.000     .3463651    .7789888
      curcol |   .8740464   .3010622     2.90   0.004     .2838538    1.464239
      colony |   1.561606   .1259851    12.40   0.000     1.314629    1.808584
     comctry |  -.4406325   1.208049    -0.36   0.715    -2.808852    1.927588
       _cons |   -27.3362    .645389   -42.36   0.000     -28.6014     -26.071
------------------------------------------------------------------------------

. estimates store t5r7

. fx_pct bothp onep
bothp: % increase in trade  49% with unrounded coeff,  49% with rounded coeff
onep: % increase in trade  43% with unrounded coeff,  43% with rounded coeff

. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1985, robust

Linear regression                                      Number of obs =    6232
                                                       F( 16,  6214) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.6034
                                                       Root MSE      =  2.3587

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .5204823   .2212835     2.35   0.019     .0866902    .9542745
        onep |   .2511981    .225655     1.11   0.266    -.1911637    .6935599
         gsp |   .7776185   .0575383    13.51   0.000     .6648237    .8904134
    regional |   1.098848   .1815014     6.05   0.000     .7430425    1.454653
    custrict |   1.489529   .2252949     6.61   0.000     1.047873    1.931185
       ldist |  -1.311265   .0454781   -28.83   0.000    -1.400418   -1.222112
       lrgdp |   .9721395   .0186901    52.01   0.000     .9355006    1.008779
     lrgdppc |   .4102588   .0296842    13.82   0.000     .3520675    .4684501
     comlang |    .334853   .0820878     4.08   0.000     .1739325    .4957735
      border |   .6526877   .1668399     3.91   0.000     .3256237    .9797516
       landl |  -.2250096   .0718509    -3.13   0.002    -.3658621    -.084157
      island |   .0465825   .0668877     0.70   0.486    -.0845404    .1777055
      lareap |  -.1269982   .0144717    -8.78   0.000    -.1553678   -.0986286
      comcol |   .3355518   .1346445     2.49   0.013      .071602    .5995015
      curcol |  -.2941074   .1575211    -1.87   0.062    -.6029031    .0146884
      colony |   1.336797   .1362325     9.81   0.000     1.069734     1.60386
     comctry |    .769685    .683503     1.13   0.260    -.5702173    2.109587
       _cons |  -30.67514   .7910994   -38.78   0.000    -32.22597   -29.12431
------------------------------------------------------------------------------

. estimates store t5r8

. fx_pct bothp onep
bothp: % increase in trade  68% with unrounded coeff,  68% with rounded coeff
onep: % increase in trade  29% with unrounded coeff,  28% with rounded coeff

. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1990, robust

Linear regression                                      Number of obs =    6620
                                                       F( 15,  6602) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.6633
                                                       Root MSE      =  2.3208

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |   .7578805   .3014674     2.51   0.012     .1669069    1.348854
        onep |   .5445441   .3049824     1.79   0.074    -.0533199    1.142408
         gsp |   .7640223   .0517616    14.76   0.000     .6625527    .8654918
    regional |   .9915952   .1872015     5.30   0.000     .6246198    1.358571
    custrict |     2.0977   .2425651     8.65   0.000     1.622193    2.573206
       ldist |  -1.329182   .0421167   -31.56   0.000    -1.411745    -1.24662
       lrgdp |   1.002412   .0177145    56.59   0.000     .9676862    1.037138
     lrgdppc |    .569832   .0304665    18.70   0.000     .5101078    .6295561
     comlang |   .3983856    .077209     5.16   0.000      .247031    .5497402
      border |   .7716817   .1920568     4.02   0.000     .3951883    1.148175
       landl |  -.1927749    .067627    -2.85   0.004    -.3253458   -.0602041
      island |  -.0584793   .0632596    -0.92   0.355    -.1824886    .0655299
      lareap |  -.0797511   .0138045    -5.78   0.000    -.1068123   -.0526898
      comcol |   .3983146    .125745     3.17   0.002     .1518136    .6448155
      curcol |  -.4093835   .1686493    -2.43   0.015    -.7399906   -.0787764
      colony |   1.165433   .1496508     7.79   0.000     .8720695    1.458798
     comctry |   .1772607   .0860514     2.06   0.039     .0085721    .3459493
       _cons |  -36.25803   .8470364   -42.81   0.000    -37.91849   -34.59756
------------------------------------------------------------------------------

. estimates store t5r9

. fx_pct bothp onep
bothp: % increase in trade 113% with unrounded coeff, 114% with rounded coeff
onep: % increase in trade  72% with unrounded coeff,  72% with rounded coeff

. 
. reg ltrade bothp onep gsp regional custrict ldist lrgdp lrgdppc comlang border landl 
> island lareap comcol curcol colony comctry if year==1995, robust

Linear regression                                      Number of obs =    7640
                                                       F( 15,  7622) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.6845
                                                       Root MSE      =   2.108

------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bothp |  -.5115992   .2441018    -2.10   0.036     -.990106   -.0330924
        onep |  -.6729128   .2469419    -2.72   0.006    -1.156987   -.1888388
         gsp |   .5870996    .045729    12.84   0.000     .4974582    .6767411
    regional |    .886132    .137527     6.44   0.000     .6165413    1.155723
    custrict |   1.377163   .2211928     6.23   0.000     .9435644    1.810762
       ldist |  -1.319917   .0360815   -36.58   0.000    -1.390646   -1.249187
       lrgdp |   .9945225   .0155758    63.85   0.000     .9639897    1.025055
     lrgdppc |   .4149458   .0249947    16.60   0.000     .3659492    .4639424
     comlang |   .3597118   .0627321     5.73   0.000     .2367397     .482684
      border |   .7947398   .1586561     5.01   0.000     .4837303    1.105749
       landl |  -.1947113   .0547582    -3.56   0.000    -.3020524   -.0873701
      island |  -.0214412   .0535562    -0.40   0.689     -.126426    .0835436
      lareap |  -.1033789   .0127664    -8.10   0.000    -.1284046   -.0783532
      comcol |    .450127   .1087399     4.14   0.000     .2369669    .6632872
      curcol |     .03456   .1529042     0.23   0.821    -.2651743    .3342942
      colony |   1.187807   .1355876     8.76   0.000     .9220179    1.453596
     comctry |  -1.121241    .078482   -14.29   0.000    -1.275087   -.9673945
       _cons |  -31.49453   .6512596   -48.36   0.000    -32.77118   -30.21788
------------------------------------------------------------------------------

. estimates store t5r10

. fx_pct bothp onep
bothp: % increase in trade -40% with unrounded coeff, -40% with rounded coeff
onep: % increase in trade -49% with unrounded coeff, -49% with rounded coeff

. 
. * print Table 5
. estimates table t5r1 t5r2 t5r3 t5r4 t5r5, se b(%5.2f) keep(bothp onep)

----------------------------------------------------------------
    Variable |  t5r1      t5r2      t5r3      t5r4      t5r5    
-------------+--------------------------------------------------
       bothp |    0.60      0.79      0.48      0.38      0.40  
             |    0.10      0.11      0.10      0.11      0.12  
        onep |    0.26      0.40      0.31      0.26      0.20  
             |    0.09      0.11      0.10      0.11      0.13  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table t5r6 t5r7 t5r8 t5r9 t5r10, se b(%5.2f) keep(bothp onep)

----------------------------------------------------------------
    Variable |  t5r6      t5r7      t5r8      t5r9      t5r10   
-------------+--------------------------------------------------
       bothp |    0.22      0.40      0.52      0.76     -0.51  
             |    0.15      0.16      0.22      0.30      0.24  
        onep |    0.14      0.36      0.25      0.54     -0.67  
             |    0.15      0.17      0.23      0.30      0.25  
----------------------------------------------------------------
                                                    legend: b/se

. estimates stats t5r1 t5r2 t5r3 t5r4 t5r5 t5r6 t5r7 t5r8 t5r9 t5r10

------------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+----------------------------------------------------------------
        t5r1 |   1115    -2357.97   -1707.495     15     3444.989    3520.239
        t5r2 |   1468   -3168.449   -2296.462     15     4622.924    4702.299
        t5r3 |   2625    -5641.66   -4341.696     17     8717.392     8817.23
        t5r4 |   3361   -7485.994   -5716.157     17     11466.31    11570.35
        t5r5 |   4737   -11872.18   -9377.048     18      18790.1    18906.43
        t5r6 |   5354   -13611.38   -10835.45     18      21706.9    21825.44
        t5r7 |   5895   -15306.81    -12194.5     18     24425.01    24545.28
        t5r8 |   6232   -17062.96   -14181.49     17     28396.97    28511.51
        t5r9 |   6620   -18561.19   -14957.83     16     29947.66    30056.43
       t5r10 |   7640    -20935.3    -16529.1     16      33090.2    33201.26
------------------------------------------------------------------------------

. 
. *****************************************************
. * BY MEMBERSHIP COMBINATION - Omitted to save space *
. *****************************************************
. 
. * gattff is already defined                                                          
>                        /* two formal members */
. gen byte gattfc = cond( (gattf1==1 & gattmbr2=="col") | (gattmbr1=="col" & gattf2==1)
> , 1, 0)                /* formal member and colonial member */

. gen byte gattfd = cond( (gattf1==1 & gattmbr2=="df") | (gattmbr1=="df" & gattf2==1), 
> 1, 0)                  /* formal member and defacto member */

. gen byte gattfp = cond( (gattf1==1 & gattmbr2=="prov") | (gattmbr1=="prov" & gattf2==
> 1), 1, 0)              /* formal member and provisional member */

. * gattfo is already defined                                                          
>                        /* formal member and outsider */
. gen byte gattcc = cond( gattmbr1=="col" & gattmbr2=="col", 1, 0)                     
>                        /* two colonial members */

. gen byte gattcd = cond( (gattmbr1=="col" & gattmbr2=="df") | (gattmbr1=="df" & gattmb
> r2=="col"), 1, 0)      /* colonial and defacto */

. gen byte gattcp = cond( (gattmbr1=="col" & gattmbr2=="prov") | (gattmbr1=="prov" & ga
> ttmbr2=="col"), 1, 0)  /* colonial and provisional */

. gen byte gattco = cond( (gattmbr1=="col" & gattmbr2=="out") | (gattmbr1=="out" & gatt
> mbr2=="col"), 1, 0)    /* colonial and outsider */

. gen byte gattdd = cond( gattmbr1=="df" & gattmbr2=="df", 1, 0)                       
>                        /* two defacto members */

. gen byte gattdp = cond( (gattmbr1=="df" & gattmbr2=="prov") | (gattmbr1=="prov" & gat
> tmbr2=="df"), 1, 0)    /* defacto and provisional */

. gen byte gattdo = cond( (gattmbr1=="df" & gattmbr2=="out") | (gattmbr1=="out" & gattm
> br2=="df"), 1, 0)      /* defacto and outsider */

. gen byte gattpp = cond( gattmbr1=="prov" & gattmbr2=="prov", 1, 0)                   
>                        /* two provisional members */

. gen byte gattpo = cond( (gattmbr1=="prov" & gattmbr2=="out") | (gattmbr1=="out" & gat
> tmbr2=="prov"), 1, 0)  /* provisional and outsider */

. 
. * display number in each category
. foreach v in gattff gattfc gattfd gattfp gattcc gattcd gattcp gattdd gattdp gattpp ga
> ttfo gattco gattdo gattpo {
  2.    tab `v'
  3. }

 GATT: Both |
     formal |
    members |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    122,077       52.04       52.04
          1 |    112,520       47.96      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattfc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    223,605       95.31       95.31
          1 |     10,992        4.69      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattfd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    211,747       90.26       90.26
          1 |     22,850        9.74      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattfp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    231,202       98.55       98.55
          1 |      3,395        1.45      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattcc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    234,025       99.76       99.76
          1 |        572        0.24      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    233,745       99.64       99.64
          1 |        852        0.36      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattcp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    234,322       99.88       99.88
          1 |        275        0.12      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattdd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    233,504       99.53       99.53
          1 |      1,093        0.47      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattdp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    234,220       99.84       99.84
          1 |        377        0.16      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattpp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    234,537       99.97       99.97
          1 |         60        0.03      100.00
------------+-----------------------------------
      Total |    234,597      100.00

      GATT: |
   Formal + |
        out |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    171,436       73.08       73.08
          1 |     63,161       26.92      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattco |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    231,190       98.55       98.55
          1 |      3,407        1.45      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattdo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    230,607       98.30       98.30
          1 |      3,990        1.70      100.00
------------+-----------------------------------
      Total |    234,597      100.00

     gattpo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    233,247       99.42       99.42
          1 |      1,350        0.58      100.00
------------+-----------------------------------
      Total |    234,597      100.00

. 
. * Analysis with year and dyadic effects
. areg ltrade gattff gattfc gattfd gattfp gattcc gattcd gattcp gattdd gattdp gattpp gat
> tfo gattco gattdo gattpo gsp regional custrict lrgdp lrgdppc curcol yrdum2-yrdum52, a
> (dyad) robust cluster(dyad)

Linear regression, absorbing indicators                Number of obs =  234597
                                                       F( 71, 12149) =  121.58
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8534
                                                       Adj R-squared =  0.8533
                                                       Root MSE      =  1.3121

                               (Std. Err. adjusted for 12150 clusters in dyad)
------------------------------------------------------------------------------
             |               Robust
      ltrade |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gattff |   .4737604   .0601194     7.88   0.000     .3559168    .5916041
      gattfc |   .6630173   .0707136     9.38   0.000     .5244073    .8016272
      gattfd |   .6017029   .0641045     9.39   0.000     .4760478    .7273579
      gattfp |   .3067327   .0697278     4.40   0.000      .170055    .4434103
      gattcc |   1.518334    .196052     7.74   0.000     1.134041    1.902627
      gattcd |   .9137661   .1328143     6.88   0.000      .653429    1.174103
      gattcp |   .5424249   .1465783     3.70   0.000     .2551081    .8297417
      gattdd |   .9306678   .1639585     5.68   0.000     .6092831    1.252053
      gattdp |   .6196128   .1682137     3.68   0.000     .2898871    .9493385
      gattpp |   .2611696   .2567562     1.02   0.309    -.2421134    .7644526
      gattfo |   .2268657   .0554886     4.09   0.000     .1180993    .3356322
      gattco |   .5160072   .0923845     5.59   0.000     .3349188    .6970955
      gattdo |   .3396263   .0900142     3.77   0.000     .1631841    .5160685
      gattpo |   .0780968   .0742022     1.05   0.293    -.0673513     .223545
         gsp |   .1761296   .0273798     6.43   0.000     .1224608    .2297985
    regional |   .7716638   .0694045    11.12   0.000     .6356199    .9077078
    custrict |   .5898576   .1172006     5.03   0.000     .3601257    .8195894
       lrgdp |   .4758994   .0460719    10.33   0.000     .3855911    .5662077
     lrgdppc |   .2037307   .0443371     4.60   0.000     .1168229    .2906384
      curcol |   .2282697   .1598853     1.43   0.153    -.0851309    .5416704
      yrdum2 |   .0127343   .0912736     0.14   0.889    -.1661764    .1916451
      yrdum3 |  -.2513522   .1301202    -1.93   0.053    -.5064086    .0037042
      yrdum4 |  -.1025159   .1301768    -0.79   0.431    -.3576832    .1526513
      yrdum5 |  -.2210592   .1307865    -1.69   0.091    -.4774215    .0353031
      yrdum6 |  -.3236552   .1312352    -2.47   0.014    -.5808971   -.0664134
      yrdum7 |  -.2979215   .1320129    -2.26   0.024    -.5566877   -.0391553
      yrdum8 |  -.3021007   .1317616    -2.29   0.022    -.5603743    -.043827
      yrdum9 |  -.3104415    .131923    -2.35   0.019    -.5690316   -.0518513
     yrdum10 |  -.2740912   .1329052    -2.06   0.039    -.5346066   -.0135757
     yrdum11 |  -.3746722   .1325208    -2.83   0.005     -.634434   -.1149103
     yrdum12 |  -.3580426   .1331001    -2.69   0.007    -.6189399   -.0971452
     yrdum13 |  -.3801903   .1336317    -2.85   0.004    -.6421298   -.1182509
     yrdum14 |  -.4098027   .1339436    -3.06   0.002    -.6723534   -.1472519
     yrdum15 |  -.4449488    .134606    -3.31   0.001     -.708798   -.1810996
     yrdum16 |  -.4009251   .1353581    -2.96   0.003    -.6662485   -.1356016
     yrdum17 |  -.3180566   .1366876    -2.33   0.020    -.5859861    -.050127
     yrdum18 |  -.3416925   .1372356    -2.49   0.013    -.6106962   -.0726888
     yrdum19 |  -.3725514   .1378648    -2.70   0.007    -.6427883   -.1023146
     yrdum20 |  -.4290582   .1387177    -3.09   0.002    -.7009669   -.1571496
     yrdum21 |  -.5336476   .1393562    -3.83   0.000    -.8068079   -.2604873
     yrdum22 |  -.7967558   .1402956    -5.68   0.000    -1.071758   -.5217541
     yrdum23 |  -.8015951    .141121    -5.68   0.000    -1.078215   -.5249755
     yrdum24 |   -.851266   .1426056    -5.97   0.000    -1.130796   -.5717363
     yrdum25 |  -.7935267   .1432008    -5.54   0.000    -1.074223   -.5128304
     yrdum26 |  -.6244462   .1443953    -4.32   0.000     -.907484   -.3414084
     yrdum27 |  -.4166052   .1453784    -2.87   0.004    -.7015701   -.1316403
     yrdum28 |  -.4788599   .1459888    -3.28   0.001    -.7650211   -.1926987
     yrdum29 |  -.5140936   .1469316    -3.50   0.000     -.802103   -.2260843
     yrdum30 |  -.4604837   .1482644    -3.11   0.002    -.7511056   -.1698618
     yrdum31 |  -.4878803   .1491484    -3.27   0.001    -.7802349   -.1955257
     yrdum32 |  -.4595206   .1500785    -3.06   0.002    -.7536985   -.1653428
     yrdum33 |  -.4494687   .1508942    -2.98   0.003    -.7452453    -.153692
     yrdum34 |  -.5729509   .1515017    -3.78   0.000    -.8699183   -.2759836
     yrdum35 |  -.7433024   .1522119    -4.88   0.000    -1.041662   -.4449429
     yrdum36 |  -.8818575   .1532463    -5.75   0.000    -1.182245   -.5814704
     yrdum37 |  -.9332866   .1540139    -6.06   0.000    -1.235178   -.6313948
     yrdum38 |  -.9879548   .1551592    -6.37   0.000    -1.292092    -.683818
     yrdum39 |  -1.032204   .1561485    -6.61   0.000     -1.33828   -.7261284
     yrdum40 |   -1.00924   .1569867    -6.43   0.000    -1.316958   -.7015207
     yrdum41 |  -.9643542    .157835    -6.11   0.000    -1.273736   -.6549725
     yrdum42 |  -.9628136   .1588295    -6.06   0.000    -1.274145   -.6514823
     yrdum43 |    -.93503   .1597354    -5.85   0.000    -1.248137   -.6219231
     yrdum44 |  -.9558351   .1607512    -5.95   0.000    -1.270933   -.6407372
     yrdum45 |  -.9124385   .1617406    -5.64   0.000    -1.229476   -.5954012
     yrdum46 |  -.9849815   .1621869    -6.07   0.000    -1.302894   -.6670693
     yrdum47 |  -.9009023   .1633338    -5.52   0.000    -1.221063   -.5807421
     yrdum48 |  -.7760866   .1645278    -4.72   0.000    -1.098587   -.4535859
     yrdum49 |  -.7544202   .1653524    -4.56   0.000    -1.078537    -.430303
     yrdum50 |  -.6907311   .1659832    -4.16   0.000    -1.016085   -.3653775
     yrdum51 |   -.443803   .1645202    -2.70   0.007    -.7662887   -.1213172
     yrdum52 |  -.5003418   .1652773    -3.03   0.002    -.8243116    -.176372
       _cons |  -15.78101   1.504957   -10.49   0.000    -18.73096   -12.83105
-------------+----------------------------------------------------------------
        dyad |   absorbed                                   (12150 categories)

. estimates store bytype_fe

. fx_pct gattff gattfc gattfd gattfp gattcc gattcd gattcp gattdd gattdp gattpp gattfo g
> attco gattdo gattpo 
gattff: % increase in trade  61% with unrounded coeff,  60% with rounded coeff
gattfc: % increase in trade  94% with unrounded coeff,  93% with rounded coeff
gattfd: % increase in trade  83% with unrounded coeff,  82% with rounded coeff
gattfp: % increase in trade  36% with unrounded coeff,  36% with rounded coeff
gattcc: % increase in trade 356% with unrounded coeff, 357% with rounded coeff
gattcd: % increase in trade 149% with unrounded coeff, 148% with rounded coeff
gattcp: % increase in trade  72% with unrounded coeff,  72% with rounded coeff
gattdd: % increase in trade 154% with unrounded coeff, 153% with rounded coeff
gattdp: % increase in trade  86% with unrounded coeff,  86% with rounded coeff
gattpp: % increase in trade  30% with unrounded coeff,  30% with rounded coeff
gattfo: % increase in trade  25% with unrounded coeff,  26% with rounded coeff
gattco: % increase in trade  68% with unrounded coeff,  68% with rounded coeff
gattdo: % increase in trade  40% with unrounded coeff,  40% with rounded coeff
gattpo: % increase in trade   8% with unrounded coeff,   8% with rounded coeff

. estimates table bytype_fe, se b(%5.2f) keep(gattff gattfc gattfd gattfp gattcc gattcd
>  gattcp gattdd gattdp gattpp gattfo gattco gattdo gattpo)    /* table with std errors
>  */

------------------------
    Variable | bytyp~e  
-------------+----------
      gattff |    0.47  
             |    0.06  
      gattfc |    0.66  
             |    0.07  
      gattfd |    0.60  
             |    0.06  
      gattfp |    0.31  
             |    0.07  
      gattcc |    1.52  
             |    0.20  
      gattcd |    0.91  
             |    0.13  
      gattcp |    0.54  
             |    0.15  
      gattdd |    0.93  
             |    0.16  
      gattdp |    0.62  
             |    0.17  
      gattpp |    0.26  
             |    0.26  
      gattfo |    0.23  
             |    0.06  
      gattco |    0.52  
             |    0.09  
      gattdo |    0.34  
             |    0.09  
      gattpo |    0.08  
             |    0.07  
------------------------
            legend: b/se

. estimates table bytype_fe, b(%5.2f) keep(gattff gattfc gattfd gattfp gattcc gattcd ga
> ttcp gattdd gattdp gattpp gattfo gattco gattdo gattpo) star  /* table with "stars" */

---------------------------
    Variable | bytype_fe   
-------------+-------------
      gattff |    0.47***  
      gattfc |    0.66***  
      gattfd |    0.60***  
      gattfp |    0.31***  
      gattcc |    1.52***  
      gattcd |    0.91***  
      gattcp |    0.54***  
      gattdd |    0.93***  
      gattdp |    0.62***  
      gattpp |    0.26     
      gattfo |    0.23***  
      gattco |    0.52***  
      gattdo |    0.34***  
      gattpo |    0.08     
---------------------------
legend: * p<0.05; ** p<0.01; *** p<0.001

. estimates stats bytype_fe

------------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+----------------------------------------------------------------
   bytype_fe |  234597  -406381.9   -390324.6     71     780791.2    781527.1
------------------------------------------------------------------------------

. 
. log close
       log:  /afs/ir.stanford.edu/users/t/o/tomz/AER2007/table5.log
  log type:  text
 closed on:  18 Jun 2007, 23:24:42
---------------------------------------------------------------------------------------
